dylad/RIOT/cpu/sam0_common/include/vendor/same51/include/compat_same51.h
#ifndef COMPAT_SAME51_H
#define COMPAT_SAME51_H

#ifdef __cplusplus
extern "C" {
#endif

#define AC_CTRLA_SWRST_Msk (_U_(0x1) << AC_CTRLA_SWRST_Pos)
#define AC_CTRLA_ENABLE_Msk (_U_(0x1) << AC_CTRLA_ENABLE_Pos)
#define AC_CTRLB_START0_Msk (_U_(0x1) << AC_CTRLB_START0_Pos)
#define AC_CTRLB_START1_Msk (_U_(0x1) << AC_CTRLB_START1_Pos)
#define AC_EVCTRL_COMPEO0_Msk (_U_(0x1) << AC_EVCTRL_COMPEO0_Pos)
#define AC_EVCTRL_COMPEO1_Msk (_U_(0x1) << AC_EVCTRL_COMPEO1_Pos)
#define AC_EVCTRL_WINEO0_Msk (_U_(0x1) << AC_EVCTRL_WINEO0_Pos)
#define AC_EVCTRL_COMPEI0_Msk (_U_(0x1) << AC_EVCTRL_COMPEI0_Pos)
#define AC_EVCTRL_COMPEI1_Msk (_U_(0x1) << AC_EVCTRL_COMPEI1_Pos)
#define AC_EVCTRL_INVEI0_Msk (_U_(0x1) << AC_EVCTRL_INVEI0_Pos)
#define AC_EVCTRL_INVEI1_Msk (_U_(0x1) << AC_EVCTRL_INVEI1_Pos)
#define AC_INTENCLR_COMP0_Msk (_U_(0x1) << AC_INTENCLR_COMP0_Pos)
#define AC_INTENCLR_COMP1_Msk (_U_(0x1) << AC_INTENCLR_COMP1_Pos)
#define AC_INTENCLR_WIN0_Msk (_U_(0x1) << AC_INTENCLR_WIN0_Pos)
#define AC_INTENSET_COMP0_Msk (_U_(0x1) << AC_INTENSET_COMP0_Pos)
#define AC_INTENSET_COMP1_Msk (_U_(0x1) << AC_INTENSET_COMP1_Pos)
#define AC_INTENSET_WIN0_Msk (_U_(0x1) << AC_INTENSET_WIN0_Pos)
#define AC_INTFLAG_COMP0_Msk (_U_(0x1) << AC_INTFLAG_COMP0_Pos)
#define AC_INTFLAG_COMP1_Msk (_U_(0x1) << AC_INTFLAG_COMP1_Pos)
#define AC_INTFLAG_WIN0_Msk (_U_(0x1) << AC_INTFLAG_WIN0_Pos)
#define AC_STATUSA_STATE0_Msk (_U_(0x1) << AC_STATUSA_STATE0_Pos)
#define AC_STATUSA_STATE1_Msk (_U_(0x1) << AC_STATUSA_STATE1_Pos)
#define AC_STATUSB_READY0_Msk (_U_(0x1) << AC_STATUSB_READY0_Pos)
#define AC_STATUSB_READY1_Msk (_U_(0x1) << AC_STATUSB_READY1_Pos)
#define AC_DBGCTRL_DBGRUN_Msk (_U_(0x1) << AC_DBGCTRL_DBGRUN_Pos)
#define AC_WINCTRL_WEN0_Msk (_U_(0x1) << AC_WINCTRL_WEN0_Pos)
#define AC_COMPCTRL_ENABLE_Msk (_U_(0x1) << AC_COMPCTRL_ENABLE_Pos)
#define AC_COMPCTRL_SINGLE_Msk (_U_(0x1) << AC_COMPCTRL_SINGLE_Pos)
#define AC_COMPCTRL_RUNSTDBY_Msk (_U_(0x1) << AC_COMPCTRL_RUNSTDBY_Pos)
#define AC_COMPCTRL_SWAP_Msk (_U_(0x1) << AC_COMPCTRL_SWAP_Pos)
#define AC_COMPCTRL_HYSTEN_Msk (_U_(0x1) << AC_COMPCTRL_HYSTEN_Pos)
#define AC_SYNCBUSY_SWRST_Msk (_U_(0x1) << AC_SYNCBUSY_SWRST_Pos)
#define AC_SYNCBUSY_ENABLE_Msk (_U_(0x1) << AC_SYNCBUSY_ENABLE_Pos)
#define AC_SYNCBUSY_WINCTRL_Msk (_U_(0x1) << AC_SYNCBUSY_WINCTRL_Pos)
#define AC_SYNCBUSY_COMPCTRL0_Msk (_U_(0x1) << AC_SYNCBUSY_COMPCTRL0_Pos)
#define AC_SYNCBUSY_COMPCTRL1_Msk (_U_(0x1) << AC_SYNCBUSY_COMPCTRL1_Pos)
#define AC_CTRLA_Msk AC_CTRLA_MASK
#define AC_CTRLB_Msk AC_CTRLB_MASK
#define AC_EVCTRL_Msk AC_EVCTRL_MASK
#define AC_INTENCLR_Msk AC_INTENCLR_MASK
#define AC_INTENSET_Msk AC_INTENSET_MASK
#define AC_INTFLAG_Msk AC_INTFLAG_MASK
#define AC_STATUSA_Msk AC_STATUSA_MASK
#define AC_STATUSB_Msk AC_STATUSB_MASK
#define AC_DBGCTRL_Msk AC_DBGCTRL_MASK
#define AC_WINCTRL_Msk AC_WINCTRL_MASK
#define AC_SCALER_Msk AC_SCALER_MASK
#define AC_COMPCTRL_Msk AC_COMPCTRL_MASK
#define AC_SYNCBUSY_Msk AC_SYNCBUSY_MASK
#define AC_CALIB_Msk AC_CALIB_MASK
#define ADC_CTRLA_SWRST_Msk (_U_(0x1) << ADC_CTRLA_SWRST_Pos)
#define ADC_CTRLA_ENABLE_Msk (_U_(0x1) << ADC_CTRLA_ENABLE_Pos)
#define ADC_CTRLA_SLAVEEN_Msk (_U_(0x1) << ADC_CTRLA_SLAVEEN_Pos)
#define ADC_CTRLA_RUNSTDBY_Msk (_U_(0x1) << ADC_CTRLA_RUNSTDBY_Pos)
#define ADC_CTRLA_ONDEMAND_Msk (_U_(0x1) << ADC_CTRLA_ONDEMAND_Pos)
#define ADC_CTRLA_R2R_Msk (_U_(0x1) << ADC_CTRLA_R2R_Pos)
#define ADC_EVCTRL_FLUSHEI_Msk (_U_(0x1) << ADC_EVCTRL_FLUSHEI_Pos)
#define ADC_EVCTRL_STARTEI_Msk (_U_(0x1) << ADC_EVCTRL_STARTEI_Pos)
#define ADC_EVCTRL_FLUSHINV_Msk (_U_(0x1) << ADC_EVCTRL_FLUSHINV_Pos)
#define ADC_EVCTRL_STARTINV_Msk (_U_(0x1) << ADC_EVCTRL_STARTINV_Pos)
#define ADC_EVCTRL_RESRDYEO_Msk (_U_(0x1) << ADC_EVCTRL_RESRDYEO_Pos)
#define ADC_EVCTRL_WINMONEO_Msk (_U_(0x1) << ADC_EVCTRL_WINMONEO_Pos)
#define ADC_DBGCTRL_DBGRUN_Msk (_U_(0x1) << ADC_DBGCTRL_DBGRUN_Pos)
#define ADC_INPUTCTRL_DIFFMODE_Msk (_U_(0x1) << ADC_INPUTCTRL_DIFFMODE_Pos)
#define ADC_INPUTCTRL_DSEQSTOP_Msk (_U_(0x1) << ADC_INPUTCTRL_DSEQSTOP_Pos)
#define ADC_CTRLB_LEFTADJ_Msk (_U_(0x1) << ADC_CTRLB_LEFTADJ_Pos)
#define ADC_CTRLB_FREERUN_Msk (_U_(0x1) << ADC_CTRLB_FREERUN_Pos)
#define ADC_CTRLB_CORREN_Msk (_U_(0x1) << ADC_CTRLB_CORREN_Pos)
#define ADC_CTRLB_WINSS_Msk (_U_(0x1) << ADC_CTRLB_WINSS_Pos)
#define ADC_REFCTRL_REFCOMP_Msk (_U_(0x1) << ADC_REFCTRL_REFCOMP_Pos)
#define ADC_SAMPCTRL_OFFCOMP_Msk (_U_(0x1) << ADC_SAMPCTRL_OFFCOMP_Pos)
#define ADC_SWTRIG_FLUSH_Msk (_U_(0x1) << ADC_SWTRIG_FLUSH_Pos)
#define ADC_SWTRIG_START_Msk (_U_(0x1) << ADC_SWTRIG_START_Pos)
#define ADC_INTENCLR_RESRDY_Msk (_U_(0x1) << ADC_INTENCLR_RESRDY_Pos)
#define ADC_INTENCLR_OVERRUN_Msk (_U_(0x1) << ADC_INTENCLR_OVERRUN_Pos)
#define ADC_INTENCLR_WINMON_Msk (_U_(0x1) << ADC_INTENCLR_WINMON_Pos)
#define ADC_INTENSET_RESRDY_Msk (_U_(0x1) << ADC_INTENSET_RESRDY_Pos)
#define ADC_INTENSET_OVERRUN_Msk (_U_(0x1) << ADC_INTENSET_OVERRUN_Pos)
#define ADC_INTENSET_WINMON_Msk (_U_(0x1) << ADC_INTENSET_WINMON_Pos)
#define ADC_INTFLAG_RESRDY_Msk (_U_(0x1) << ADC_INTFLAG_RESRDY_Pos)
#define ADC_INTFLAG_OVERRUN_Msk (_U_(0x1) << ADC_INTFLAG_OVERRUN_Pos)
#define ADC_INTFLAG_WINMON_Msk (_U_(0x1) << ADC_INTFLAG_WINMON_Pos)
#define ADC_STATUS_ADCBUSY_Msk (_U_(0x1) << ADC_STATUS_ADCBUSY_Pos)
#define ADC_SYNCBUSY_SWRST_Msk (_U_(0x1) << ADC_SYNCBUSY_SWRST_Pos)
#define ADC_SYNCBUSY_ENABLE_Msk (_U_(0x1) << ADC_SYNCBUSY_ENABLE_Pos)
#define ADC_SYNCBUSY_INPUTCTRL_Msk (_U_(0x1) << ADC_SYNCBUSY_INPUTCTRL_Pos)
#define ADC_SYNCBUSY_CTRLB_Msk (_U_(0x1) << ADC_SYNCBUSY_CTRLB_Pos)
#define ADC_SYNCBUSY_REFCTRL_Msk (_U_(0x1) << ADC_SYNCBUSY_REFCTRL_Pos)
#define ADC_SYNCBUSY_AVGCTRL_Msk (_U_(0x1) << ADC_SYNCBUSY_AVGCTRL_Pos)
#define ADC_SYNCBUSY_SAMPCTRL_Msk (_U_(0x1) << ADC_SYNCBUSY_SAMPCTRL_Pos)
#define ADC_SYNCBUSY_WINLT_Msk (_U_(0x1) << ADC_SYNCBUSY_WINLT_Pos)
#define ADC_SYNCBUSY_WINUT_Msk (_U_(0x1) << ADC_SYNCBUSY_WINUT_Pos)
#define ADC_SYNCBUSY_GAINCORR_Msk (_U_(0x1) << ADC_SYNCBUSY_GAINCORR_Pos)
#define ADC_SYNCBUSY_OFFSETCORR_Msk (_U_(0x1) << ADC_SYNCBUSY_OFFSETCORR_Pos)
#define ADC_SYNCBUSY_SWTRIG_Msk (_U_(0x1) << ADC_SYNCBUSY_SWTRIG_Pos)
#define ADC_DSEQCTRL_INPUTCTRL_Msk (_U_(0x1) << ADC_DSEQCTRL_INPUTCTRL_Pos)
#define ADC_DSEQCTRL_CTRLB_Msk (_U_(0x1) << ADC_DSEQCTRL_CTRLB_Pos)
#define ADC_DSEQCTRL_REFCTRL_Msk (_U_(0x1) << ADC_DSEQCTRL_REFCTRL_Pos)
#define ADC_DSEQCTRL_AVGCTRL_Msk (_U_(0x1) << ADC_DSEQCTRL_AVGCTRL_Pos)
#define ADC_DSEQCTRL_SAMPCTRL_Msk (_U_(0x1) << ADC_DSEQCTRL_SAMPCTRL_Pos)
#define ADC_DSEQCTRL_WINLT_Msk (_U_(0x1) << ADC_DSEQCTRL_WINLT_Pos)
#define ADC_DSEQCTRL_WINUT_Msk (_U_(0x1) << ADC_DSEQCTRL_WINUT_Pos)
#define ADC_DSEQCTRL_GAINCORR_Msk (_U_(0x1) << ADC_DSEQCTRL_GAINCORR_Pos)
#define ADC_DSEQCTRL_OFFSETCORR_Msk (_U_(0x1) << ADC_DSEQCTRL_OFFSETCORR_Pos)
#define ADC_DSEQCTRL_AUTOSTART_Msk (_U_(0x1) << ADC_DSEQCTRL_AUTOSTART_Pos)
#define ADC_DSEQSTAT_INPUTCTRL_Msk (_U_(0x1) << ADC_DSEQSTAT_INPUTCTRL_Pos)
#define ADC_DSEQSTAT_CTRLB_Msk (_U_(0x1) << ADC_DSEQSTAT_CTRLB_Pos)
#define ADC_DSEQSTAT_REFCTRL_Msk (_U_(0x1) << ADC_DSEQSTAT_REFCTRL_Pos)
#define ADC_DSEQSTAT_AVGCTRL_Msk (_U_(0x1) << ADC_DSEQSTAT_AVGCTRL_Pos)
#define ADC_DSEQSTAT_SAMPCTRL_Msk (_U_(0x1) << ADC_DSEQSTAT_SAMPCTRL_Pos)
#define ADC_DSEQSTAT_WINLT_Msk (_U_(0x1) << ADC_DSEQSTAT_WINLT_Pos)
#define ADC_DSEQSTAT_WINUT_Msk (_U_(0x1) << ADC_DSEQSTAT_WINUT_Pos)
#define ADC_DSEQSTAT_GAINCORR_Msk (_U_(0x1) << ADC_DSEQSTAT_GAINCORR_Pos)
#define ADC_DSEQSTAT_OFFSETCORR_Msk (_U_(0x1) << ADC_DSEQSTAT_OFFSETCORR_Pos)
#define ADC_DSEQSTAT_BUSY_Msk (_U_(0x1) << ADC_DSEQSTAT_BUSY_Pos)
#define ADC_CTRLA_Msk ADC_CTRLA_MASK
#define ADC_EVCTRL_Msk ADC_EVCTRL_MASK
#define ADC_DBGCTRL_Msk ADC_DBGCTRL_MASK
#define ADC_INPUTCTRL_Msk ADC_INPUTCTRL_MASK
#define ADC_CTRLB_Msk ADC_CTRLB_MASK
#define ADC_REFCTRL_Msk ADC_REFCTRL_MASK
#define ADC_AVGCTRL_Msk ADC_AVGCTRL_MASK
#define ADC_SAMPCTRL_Msk ADC_SAMPCTRL_MASK
#define ADC_WINLT_Msk ADC_WINLT_MASK
#define ADC_WINUT_Msk ADC_WINUT_MASK
#define ADC_GAINCORR_Msk ADC_GAINCORR_MASK
#define ADC_OFFSETCORR_Msk ADC_OFFSETCORR_MASK
#define ADC_SWTRIG_Msk ADC_SWTRIG_MASK
#define ADC_INTENCLR_Msk ADC_INTENCLR_MASK
#define ADC_INTENSET_Msk ADC_INTENSET_MASK
#define ADC_INTFLAG_Msk ADC_INTFLAG_MASK
#define ADC_STATUS_Msk ADC_STATUS_MASK
#define ADC_SYNCBUSY_Msk ADC_SYNCBUSY_MASK
#define ADC_DSEQDATA_Msk ADC_DSEQDATA_MASK
#define ADC_DSEQCTRL_Msk ADC_DSEQCTRL_MASK
#define ADC_DSEQSTAT_Msk ADC_DSEQSTAT_MASK
#define ADC_RESULT_Msk ADC_RESULT_MASK
#define ADC_RESS_Msk ADC_RESS_MASK
#define ADC_CALIB_Msk ADC_CALIB_MASK
#define AES_CTRLA_SWRST_Msk (_U_(0x1) << AES_CTRLA_SWRST_Pos)
#define AES_CTRLA_ENABLE_Msk (_U_(0x1) << AES_CTRLA_ENABLE_Pos)
#define AES_CTRLA_CIPHER_Msk (_U_(0x1) << AES_CTRLA_CIPHER_Pos)
#define AES_CTRLA_STARTMODE_Msk (_U_(0x1) << AES_CTRLA_STARTMODE_Pos)
#define AES_CTRLA_LOD_Msk (_U_(0x1) << AES_CTRLA_LOD_Pos)
#define AES_CTRLA_KEYGEN_Msk (_U_(0x1) << AES_CTRLA_KEYGEN_Pos)
#define AES_CTRLA_XORKEY_Msk (_U_(0x1) << AES_CTRLA_XORKEY_Pos)
#define AES_CTRLB_START_Msk (_U_(0x1) << AES_CTRLB_START_Pos)
#define AES_CTRLB_NEWMSG_Msk (_U_(0x1) << AES_CTRLB_NEWMSG_Pos)
#define AES_CTRLB_EOM_Msk (_U_(0x1) << AES_CTRLB_EOM_Pos)
#define AES_CTRLB_GFMUL_Msk (_U_(0x1) << AES_CTRLB_GFMUL_Pos)
#define AES_INTENCLR_ENCCMP_Msk (_U_(0x1) << AES_INTENCLR_ENCCMP_Pos)
#define AES_INTENCLR_GFMCMP_Msk (_U_(0x1) << AES_INTENCLR_GFMCMP_Pos)
#define AES_INTENSET_ENCCMP_Msk (_U_(0x1) << AES_INTENSET_ENCCMP_Pos)
#define AES_INTENSET_GFMCMP_Msk (_U_(0x1) << AES_INTENSET_GFMCMP_Pos)
#define AES_INTFLAG_ENCCMP_Msk (_U_(0x1) << AES_INTFLAG_ENCCMP_Pos)
#define AES_INTFLAG_GFMCMP_Msk (_U_(0x1) << AES_INTFLAG_GFMCMP_Pos)
#define AES_DBGCTRL_DBGRUN_Msk (_U_(0x1) << AES_DBGCTRL_DBGRUN_Pos)
#define AES_CTRLA_Msk AES_CTRLA_MASK
#define AES_CTRLB_Msk AES_CTRLB_MASK
#define AES_INTENCLR_Msk AES_INTENCLR_MASK
#define AES_INTENSET_Msk AES_INTENSET_MASK
#define AES_INTFLAG_Msk AES_INTFLAG_MASK
#define AES_DATABUFPTR_Msk AES_DATABUFPTR_MASK
#define AES_DBGCTRL_Msk AES_DBGCTRL_MASK
#define AES_KEYWORD_Msk AES_KEYWORD_MASK
#define AES_INDATA_Msk AES_INDATA_MASK
#define AES_INTVECTV_Msk AES_INTVECTV_MASK
#define AES_HASHKEY_Msk AES_HASHKEY_MASK
#define AES_GHASH_Msk AES_GHASH_MASK
#define AES_CIPLEN_Msk AES_CIPLEN_MASK
#define AES_RANDSEED_Msk AES_RANDSEED_MASK
#define CAN_DBTP_TDC_Msk (_U_(0x1) << CAN_DBTP_TDC_Pos)
#define CAN_TEST_LBCK_Msk (_U_(0x1) << CAN_TEST_LBCK_Pos)
#define CAN_TEST_RX_Msk (_U_(0x1) << CAN_TEST_RX_Pos)
#define CAN_CCCR_INIT_Msk (_U_(0x1) << CAN_CCCR_INIT_Pos)
#define CAN_CCCR_CCE_Msk (_U_(0x1) << CAN_CCCR_CCE_Pos)
#define CAN_CCCR_ASM_Msk (_U_(0x1) << CAN_CCCR_ASM_Pos)
#define CAN_CCCR_CSA_Msk (_U_(0x1) << CAN_CCCR_CSA_Pos)
#define CAN_CCCR_CSR_Msk (_U_(0x1) << CAN_CCCR_CSR_Pos)
#define CAN_CCCR_MON_Msk (_U_(0x1) << CAN_CCCR_MON_Pos)
#define CAN_CCCR_DAR_Msk (_U_(0x1) << CAN_CCCR_DAR_Pos)
#define CAN_CCCR_TEST_Msk (_U_(0x1) << CAN_CCCR_TEST_Pos)
#define CAN_CCCR_FDOE_Msk (_U_(0x1) << CAN_CCCR_FDOE_Pos)
#define CAN_CCCR_BRSE_Msk (_U_(0x1) << CAN_CCCR_BRSE_Pos)
#define CAN_CCCR_PXHD_Msk (_U_(0x1) << CAN_CCCR_PXHD_Pos)
#define CAN_CCCR_EFBI_Msk (_U_(0x1) << CAN_CCCR_EFBI_Pos)
#define CAN_CCCR_TXP_Msk (_U_(0x1) << CAN_CCCR_TXP_Pos)
#define CAN_CCCR_NISO_Msk (_U_(0x1) << CAN_CCCR_NISO_Pos)
#define CAN_TOCC_ETOC_Msk (_U_(0x1) << CAN_TOCC_ETOC_Pos)
#define CAN_ECR_RP_Msk (_U_(0x1) << CAN_ECR_RP_Pos)
#define CAN_PSR_EP_Msk (_U_(0x1) << CAN_PSR_EP_Pos)
#define CAN_PSR_EW_Msk (_U_(0x1) << CAN_PSR_EW_Pos)
#define CAN_PSR_BO_Msk (_U_(0x1) << CAN_PSR_BO_Pos)
#define CAN_PSR_RESI_Msk (_U_(0x1) << CAN_PSR_RESI_Pos)
#define CAN_PSR_RBRS_Msk (_U_(0x1) << CAN_PSR_RBRS_Pos)
#define CAN_PSR_RFDF_Msk (_U_(0x1) << CAN_PSR_RFDF_Pos)
#define CAN_PSR_PXE_Msk (_U_(0x1) << CAN_PSR_PXE_Pos)
#define CAN_IR_RF0N_Msk (_U_(0x1) << CAN_IR_RF0N_Pos)
#define CAN_IR_RF0W_Msk (_U_(0x1) << CAN_IR_RF0W_Pos)
#define CAN_IR_RF0F_Msk (_U_(0x1) << CAN_IR_RF0F_Pos)
#define CAN_IR_RF0L_Msk (_U_(0x1) << CAN_IR_RF0L_Pos)
#define CAN_IR_RF1N_Msk (_U_(0x1) << CAN_IR_RF1N_Pos)
#define CAN_IR_RF1W_Msk (_U_(0x1) << CAN_IR_RF1W_Pos)
#define CAN_IR_RF1F_Msk (_U_(0x1) << CAN_IR_RF1F_Pos)
#define CAN_IR_RF1L_Msk (_U_(0x1) << CAN_IR_RF1L_Pos)
#define CAN_IR_HPM_Msk (_U_(0x1) << CAN_IR_HPM_Pos)
#define CAN_IR_TC_Msk (_U_(0x1) << CAN_IR_TC_Pos)
#define CAN_IR_TCF_Msk (_U_(0x1) << CAN_IR_TCF_Pos)
#define CAN_IR_TFE_Msk (_U_(0x1) << CAN_IR_TFE_Pos)
#define CAN_IR_TEFN_Msk (_U_(0x1) << CAN_IR_TEFN_Pos)
#define CAN_IR_TEFW_Msk (_U_(0x1) << CAN_IR_TEFW_Pos)
#define CAN_IR_TEFF_Msk (_U_(0x1) << CAN_IR_TEFF_Pos)
#define CAN_IR_TEFL_Msk (_U_(0x1) << CAN_IR_TEFL_Pos)
#define CAN_IR_TSW_Msk (_U_(0x1) << CAN_IR_TSW_Pos)
#define CAN_IR_MRAF_Msk (_U_(0x1) << CAN_IR_MRAF_Pos)
#define CAN_IR_TOO_Msk (_U_(0x1) << CAN_IR_TOO_Pos)
#define CAN_IR_DRX_Msk (_U_(0x1) << CAN_IR_DRX_Pos)
#define CAN_IR_BEC_Msk (_U_(0x1) << CAN_IR_BEC_Pos)
#define CAN_IR_BEU_Msk (_U_(0x1) << CAN_IR_BEU_Pos)
#define CAN_IR_ELO_Msk (_U_(0x1) << CAN_IR_ELO_Pos)
#define CAN_IR_EP_Msk (_U_(0x1) << CAN_IR_EP_Pos)
#define CAN_IR_EW_Msk (_U_(0x1) << CAN_IR_EW_Pos)
#define CAN_IR_BO_Msk (_U_(0x1) << CAN_IR_BO_Pos)
#define CAN_IR_WDI_Msk (_U_(0x1) << CAN_IR_WDI_Pos)
#define CAN_IR_PEA_Msk (_U_(0x1) << CAN_IR_PEA_Pos)
#define CAN_IR_PED_Msk (_U_(0x1) << CAN_IR_PED_Pos)
#define CAN_IR_ARA_Msk (_U_(0x1) << CAN_IR_ARA_Pos)
#define CAN_IE_RF0NE_Msk (_U_(0x1) << CAN_IE_RF0NE_Pos)
#define CAN_IE_RF0WE_Msk (_U_(0x1) << CAN_IE_RF0WE_Pos)
#define CAN_IE_RF0FE_Msk (_U_(0x1) << CAN_IE_RF0FE_Pos)
#define CAN_IE_RF0LE_Msk (_U_(0x1) << CAN_IE_RF0LE_Pos)
#define CAN_IE_RF1NE_Msk (_U_(0x1) << CAN_IE_RF1NE_Pos)
#define CAN_IE_RF1WE_Msk (_U_(0x1) << CAN_IE_RF1WE_Pos)
#define CAN_IE_RF1FE_Msk (_U_(0x1) << CAN_IE_RF1FE_Pos)
#define CAN_IE_RF1LE_Msk (_U_(0x1) << CAN_IE_RF1LE_Pos)
#define CAN_IE_HPME_Msk (_U_(0x1) << CAN_IE_HPME_Pos)
#define CAN_IE_TCE_Msk (_U_(0x1) << CAN_IE_TCE_Pos)
#define CAN_IE_TCFE_Msk (_U_(0x1) << CAN_IE_TCFE_Pos)
#define CAN_IE_TFEE_Msk (_U_(0x1) << CAN_IE_TFEE_Pos)
#define CAN_IE_TEFNE_Msk (_U_(0x1) << CAN_IE_TEFNE_Pos)
#define CAN_IE_TEFWE_Msk (_U_(0x1) << CAN_IE_TEFWE_Pos)
#define CAN_IE_TEFFE_Msk (_U_(0x1) << CAN_IE_TEFFE_Pos)
#define CAN_IE_TEFLE_Msk (_U_(0x1) << CAN_IE_TEFLE_Pos)
#define CAN_IE_TSWE_Msk (_U_(0x1) << CAN_IE_TSWE_Pos)
#define CAN_IE_MRAFE_Msk (_U_(0x1) << CAN_IE_MRAFE_Pos)
#define CAN_IE_TOOE_Msk (_U_(0x1) << CAN_IE_TOOE_Pos)
#define CAN_IE_DRXE_Msk (_U_(0x1) << CAN_IE_DRXE_Pos)
#define CAN_IE_BECE_Msk (_U_(0x1) << CAN_IE_BECE_Pos)
#define CAN_IE_BEUE_Msk (_U_(0x1) << CAN_IE_BEUE_Pos)
#define CAN_IE_ELOE_Msk (_U_(0x1) << CAN_IE_ELOE_Pos)
#define CAN_IE_EPE_Msk (_U_(0x1) << CAN_IE_EPE_Pos)
#define CAN_IE_EWE_Msk (_U_(0x1) << CAN_IE_EWE_Pos)
#define CAN_IE_BOE_Msk (_U_(0x1) << CAN_IE_BOE_Pos)
#define CAN_IE_WDIE_Msk (_U_(0x1) << CAN_IE_WDIE_Pos)
#define CAN_IE_PEAE_Msk (_U_(0x1) << CAN_IE_PEAE_Pos)
#define CAN_IE_PEDE_Msk (_U_(0x1) << CAN_IE_PEDE_Pos)
#define CAN_IE_ARAE_Msk (_U_(0x1) << CAN_IE_ARAE_Pos)
#define CAN_ILS_RF0NL_Msk (_U_(0x1) << CAN_ILS_RF0NL_Pos)
#define CAN_ILS_RF0WL_Msk (_U_(0x1) << CAN_ILS_RF0WL_Pos)
#define CAN_ILS_RF0FL_Msk (_U_(0x1) << CAN_ILS_RF0FL_Pos)
#define CAN_ILS_RF0LL_Msk (_U_(0x1) << CAN_ILS_RF0LL_Pos)
#define CAN_ILS_RF1NL_Msk (_U_(0x1) << CAN_ILS_RF1NL_Pos)
#define CAN_ILS_RF1WL_Msk (_U_(0x1) << CAN_ILS_RF1WL_Pos)
#define CAN_ILS_RF1FL_Msk (_U_(0x1) << CAN_ILS_RF1FL_Pos)
#define CAN_ILS_RF1LL_Msk (_U_(0x1) << CAN_ILS_RF1LL_Pos)
#define CAN_ILS_HPML_Msk (_U_(0x1) << CAN_ILS_HPML_Pos)
#define CAN_ILS_TCL_Msk (_U_(0x1) << CAN_ILS_TCL_Pos)
#define CAN_ILS_TCFL_Msk (_U_(0x1) << CAN_ILS_TCFL_Pos)
#define CAN_ILS_TFEL_Msk (_U_(0x1) << CAN_ILS_TFEL_Pos)
#define CAN_ILS_TEFNL_Msk (_U_(0x1) << CAN_ILS_TEFNL_Pos)
#define CAN_ILS_TEFWL_Msk (_U_(0x1) << CAN_ILS_TEFWL_Pos)
#define CAN_ILS_TEFFL_Msk (_U_(0x1) << CAN_ILS_TEFFL_Pos)
#define CAN_ILS_TEFLL_Msk (_U_(0x1) << CAN_ILS_TEFLL_Pos)
#define CAN_ILS_TSWL_Msk (_U_(0x1) << CAN_ILS_TSWL_Pos)
#define CAN_ILS_MRAFL_Msk (_U_(0x1) << CAN_ILS_MRAFL_Pos)
#define CAN_ILS_TOOL_Msk (_U_(0x1) << CAN_ILS_TOOL_Pos)
#define CAN_ILS_DRXL_Msk (_U_(0x1) << CAN_ILS_DRXL_Pos)
#define CAN_ILS_BECL_Msk (_U_(0x1) << CAN_ILS_BECL_Pos)
#define CAN_ILS_BEUL_Msk (_U_(0x1) << CAN_ILS_BEUL_Pos)
#define CAN_ILS_ELOL_Msk (_U_(0x1) << CAN_ILS_ELOL_Pos)
#define CAN_ILS_EPL_Msk (_U_(0x1) << CAN_ILS_EPL_Pos)
#define CAN_ILS_EWL_Msk (_U_(0x1) << CAN_ILS_EWL_Pos)
#define CAN_ILS_BOL_Msk (_U_(0x1) << CAN_ILS_BOL_Pos)
#define CAN_ILS_WDIL_Msk (_U_(0x1) << CAN_ILS_WDIL_Pos)
#define CAN_ILS_PEAL_Msk (_U_(0x1) << CAN_ILS_PEAL_Pos)
#define CAN_ILS_PEDL_Msk (_U_(0x1) << CAN_ILS_PEDL_Pos)
#define CAN_ILS_ARAL_Msk (_U_(0x1) << CAN_ILS_ARAL_Pos)
#define CAN_ILE_EINT0_Msk (_U_(0x1) << CAN_ILE_EINT0_Pos)
#define CAN_ILE_EINT1_Msk (_U_(0x1) << CAN_ILE_EINT1_Pos)
#define CAN_GFC_RRFE_Msk (_U_(0x1) << CAN_GFC_RRFE_Pos)
#define CAN_GFC_RRFS_Msk (_U_(0x1) << CAN_GFC_RRFS_Pos)
#define CAN_HPMS_FLST_Msk (_U_(0x1) << CAN_HPMS_FLST_Pos)
#define CAN_NDAT1_ND0_Msk (_U_(0x1) << CAN_NDAT1_ND0_Pos)
#define CAN_NDAT1_ND1_Msk (_U_(0x1) << CAN_NDAT1_ND1_Pos)
#define CAN_NDAT1_ND2_Msk (_U_(0x1) << CAN_NDAT1_ND2_Pos)
#define CAN_NDAT1_ND3_Msk (_U_(0x1) << CAN_NDAT1_ND3_Pos)
#define CAN_NDAT1_ND4_Msk (_U_(0x1) << CAN_NDAT1_ND4_Pos)
#define CAN_NDAT1_ND5_Msk (_U_(0x1) << CAN_NDAT1_ND5_Pos)
#define CAN_NDAT1_ND6_Msk (_U_(0x1) << CAN_NDAT1_ND6_Pos)
#define CAN_NDAT1_ND7_Msk (_U_(0x1) << CAN_NDAT1_ND7_Pos)
#define CAN_NDAT1_ND8_Msk (_U_(0x1) << CAN_NDAT1_ND8_Pos)
#define CAN_NDAT1_ND9_Msk (_U_(0x1) << CAN_NDAT1_ND9_Pos)
#define CAN_NDAT1_ND10_Msk (_U_(0x1) << CAN_NDAT1_ND10_Pos)
#define CAN_NDAT1_ND11_Msk (_U_(0x1) << CAN_NDAT1_ND11_Pos)
#define CAN_NDAT1_ND12_Msk (_U_(0x1) << CAN_NDAT1_ND12_Pos)
#define CAN_NDAT1_ND13_Msk (_U_(0x1) << CAN_NDAT1_ND13_Pos)
#define CAN_NDAT1_ND14_Msk (_U_(0x1) << CAN_NDAT1_ND14_Pos)
#define CAN_NDAT1_ND15_Msk (_U_(0x1) << CAN_NDAT1_ND15_Pos)
#define CAN_NDAT1_ND16_Msk (_U_(0x1) << CAN_NDAT1_ND16_Pos)
#define CAN_NDAT1_ND17_Msk (_U_(0x1) << CAN_NDAT1_ND17_Pos)
#define CAN_NDAT1_ND18_Msk (_U_(0x1) << CAN_NDAT1_ND18_Pos)
#define CAN_NDAT1_ND19_Msk (_U_(0x1) << CAN_NDAT1_ND19_Pos)
#define CAN_NDAT1_ND20_Msk (_U_(0x1) << CAN_NDAT1_ND20_Pos)
#define CAN_NDAT1_ND21_Msk (_U_(0x1) << CAN_NDAT1_ND21_Pos)
#define CAN_NDAT1_ND22_Msk (_U_(0x1) << CAN_NDAT1_ND22_Pos)
#define CAN_NDAT1_ND23_Msk (_U_(0x1) << CAN_NDAT1_ND23_Pos)
#define CAN_NDAT1_ND24_Msk (_U_(0x1) << CAN_NDAT1_ND24_Pos)
#define CAN_NDAT1_ND25_Msk (_U_(0x1) << CAN_NDAT1_ND25_Pos)
#define CAN_NDAT1_ND26_Msk (_U_(0x1) << CAN_NDAT1_ND26_Pos)
#define CAN_NDAT1_ND27_Msk (_U_(0x1) << CAN_NDAT1_ND27_Pos)
#define CAN_NDAT1_ND28_Msk (_U_(0x1) << CAN_NDAT1_ND28_Pos)
#define CAN_NDAT1_ND29_Msk (_U_(0x1) << CAN_NDAT1_ND29_Pos)
#define CAN_NDAT1_ND30_Msk (_U_(0x1) << CAN_NDAT1_ND30_Pos)
#define CAN_NDAT1_ND31_Msk (_U_(0x1) << CAN_NDAT1_ND31_Pos)
#define CAN_NDAT2_ND32_Msk (_U_(0x1) << CAN_NDAT2_ND32_Pos)
#define CAN_NDAT2_ND33_Msk (_U_(0x1) << CAN_NDAT2_ND33_Pos)
#define CAN_NDAT2_ND34_Msk (_U_(0x1) << CAN_NDAT2_ND34_Pos)
#define CAN_NDAT2_ND35_Msk (_U_(0x1) << CAN_NDAT2_ND35_Pos)
#define CAN_NDAT2_ND36_Msk (_U_(0x1) << CAN_NDAT2_ND36_Pos)
#define CAN_NDAT2_ND37_Msk (_U_(0x1) << CAN_NDAT2_ND37_Pos)
#define CAN_NDAT2_ND38_Msk (_U_(0x1) << CAN_NDAT2_ND38_Pos)
#define CAN_NDAT2_ND39_Msk (_U_(0x1) << CAN_NDAT2_ND39_Pos)
#define CAN_NDAT2_ND40_Msk (_U_(0x1) << CAN_NDAT2_ND40_Pos)
#define CAN_NDAT2_ND41_Msk (_U_(0x1) << CAN_NDAT2_ND41_Pos)
#define CAN_NDAT2_ND42_Msk (_U_(0x1) << CAN_NDAT2_ND42_Pos)
#define CAN_NDAT2_ND43_Msk (_U_(0x1) << CAN_NDAT2_ND43_Pos)
#define CAN_NDAT2_ND44_Msk (_U_(0x1) << CAN_NDAT2_ND44_Pos)
#define CAN_NDAT2_ND45_Msk (_U_(0x1) << CAN_NDAT2_ND45_Pos)
#define CAN_NDAT2_ND46_Msk (_U_(0x1) << CAN_NDAT2_ND46_Pos)
#define CAN_NDAT2_ND47_Msk (_U_(0x1) << CAN_NDAT2_ND47_Pos)
#define CAN_NDAT2_ND48_Msk (_U_(0x1) << CAN_NDAT2_ND48_Pos)
#define CAN_NDAT2_ND49_Msk (_U_(0x1) << CAN_NDAT2_ND49_Pos)
#define CAN_NDAT2_ND50_Msk (_U_(0x1) << CAN_NDAT2_ND50_Pos)
#define CAN_NDAT2_ND51_Msk (_U_(0x1) << CAN_NDAT2_ND51_Pos)
#define CAN_NDAT2_ND52_Msk (_U_(0x1) << CAN_NDAT2_ND52_Pos)
#define CAN_NDAT2_ND53_Msk (_U_(0x1) << CAN_NDAT2_ND53_Pos)
#define CAN_NDAT2_ND54_Msk (_U_(0x1) << CAN_NDAT2_ND54_Pos)
#define CAN_NDAT2_ND55_Msk (_U_(0x1) << CAN_NDAT2_ND55_Pos)
#define CAN_NDAT2_ND56_Msk (_U_(0x1) << CAN_NDAT2_ND56_Pos)
#define CAN_NDAT2_ND57_Msk (_U_(0x1) << CAN_NDAT2_ND57_Pos)
#define CAN_NDAT2_ND58_Msk (_U_(0x1) << CAN_NDAT2_ND58_Pos)
#define CAN_NDAT2_ND59_Msk (_U_(0x1) << CAN_NDAT2_ND59_Pos)
#define CAN_NDAT2_ND60_Msk (_U_(0x1) << CAN_NDAT2_ND60_Pos)
#define CAN_NDAT2_ND61_Msk (_U_(0x1) << CAN_NDAT2_ND61_Pos)
#define CAN_NDAT2_ND62_Msk (_U_(0x1) << CAN_NDAT2_ND62_Pos)
#define CAN_NDAT2_ND63_Msk (_U_(0x1) << CAN_NDAT2_ND63_Pos)
#define CAN_RXF0C_F0OM_Msk (_U_(0x1) << CAN_RXF0C_F0OM_Pos)
#define CAN_RXF0S_F0F_Msk (_U_(0x1) << CAN_RXF0S_F0F_Pos)
#define CAN_RXF0S_RF0L_Msk (_U_(0x1) << CAN_RXF0S_RF0L_Pos)
#define CAN_RXF1C_F1OM_Msk (_U_(0x1) << CAN_RXF1C_F1OM_Pos)
#define CAN_RXF1S_F1F_Msk (_U_(0x1) << CAN_RXF1S_F1F_Pos)
#define CAN_RXF1S_RF1L_Msk (_U_(0x1) << CAN_RXF1S_RF1L_Pos)
#define CAN_TXBC_TFQM_Msk (_U_(0x1) << CAN_TXBC_TFQM_Pos)
#define CAN_TXFQS_TFQF_Msk (_U_(0x1) << CAN_TXFQS_TFQF_Pos)
#define CAN_TXBRP_TRP0_Msk (_U_(0x1) << CAN_TXBRP_TRP0_Pos)
#define CAN_TXBRP_TRP1_Msk (_U_(0x1) << CAN_TXBRP_TRP1_Pos)
#define CAN_TXBRP_TRP2_Msk (_U_(0x1) << CAN_TXBRP_TRP2_Pos)
#define CAN_TXBRP_TRP3_Msk (_U_(0x1) << CAN_TXBRP_TRP3_Pos)
#define CAN_TXBRP_TRP4_Msk (_U_(0x1) << CAN_TXBRP_TRP4_Pos)
#define CAN_TXBRP_TRP5_Msk (_U_(0x1) << CAN_TXBRP_TRP5_Pos)
#define CAN_TXBRP_TRP6_Msk (_U_(0x1) << CAN_TXBRP_TRP6_Pos)
#define CAN_TXBRP_TRP7_Msk (_U_(0x1) << CAN_TXBRP_TRP7_Pos)
#define CAN_TXBRP_TRP8_Msk (_U_(0x1) << CAN_TXBRP_TRP8_Pos)
#define CAN_TXBRP_TRP9_Msk (_U_(0x1) << CAN_TXBRP_TRP9_Pos)
#define CAN_TXBRP_TRP10_Msk (_U_(0x1) << CAN_TXBRP_TRP10_Pos)
#define CAN_TXBRP_TRP11_Msk (_U_(0x1) << CAN_TXBRP_TRP11_Pos)
#define CAN_TXBRP_TRP12_Msk (_U_(0x1) << CAN_TXBRP_TRP12_Pos)
#define CAN_TXBRP_TRP13_Msk (_U_(0x1) << CAN_TXBRP_TRP13_Pos)
#define CAN_TXBRP_TRP14_Msk (_U_(0x1) << CAN_TXBRP_TRP14_Pos)
#define CAN_TXBRP_TRP15_Msk (_U_(0x1) << CAN_TXBRP_TRP15_Pos)
#define CAN_TXBRP_TRP16_Msk (_U_(0x1) << CAN_TXBRP_TRP16_Pos)
#define CAN_TXBRP_TRP17_Msk (_U_(0x1) << CAN_TXBRP_TRP17_Pos)
#define CAN_TXBRP_TRP18_Msk (_U_(0x1) << CAN_TXBRP_TRP18_Pos)
#define CAN_TXBRP_TRP19_Msk (_U_(0x1) << CAN_TXBRP_TRP19_Pos)
#define CAN_TXBRP_TRP20_Msk (_U_(0x1) << CAN_TXBRP_TRP20_Pos)
#define CAN_TXBRP_TRP21_Msk (_U_(0x1) << CAN_TXBRP_TRP21_Pos)
#define CAN_TXBRP_TRP22_Msk (_U_(0x1) << CAN_TXBRP_TRP22_Pos)
#define CAN_TXBRP_TRP23_Msk (_U_(0x1) << CAN_TXBRP_TRP23_Pos)
#define CAN_TXBRP_TRP24_Msk (_U_(0x1) << CAN_TXBRP_TRP24_Pos)
#define CAN_TXBRP_TRP25_Msk (_U_(0x1) << CAN_TXBRP_TRP25_Pos)
#define CAN_TXBRP_TRP26_Msk (_U_(0x1) << CAN_TXBRP_TRP26_Pos)
#define CAN_TXBRP_TRP27_Msk (_U_(0x1) << CAN_TXBRP_TRP27_Pos)
#define CAN_TXBRP_TRP28_Msk (_U_(0x1) << CAN_TXBRP_TRP28_Pos)
#define CAN_TXBRP_TRP29_Msk (_U_(0x1) << CAN_TXBRP_TRP29_Pos)
#define CAN_TXBRP_TRP30_Msk (_U_(0x1) << CAN_TXBRP_TRP30_Pos)
#define CAN_TXBRP_TRP31_Msk (_U_(0x1) << CAN_TXBRP_TRP31_Pos)
#define CAN_TXBAR_AR0_Msk (_U_(0x1) << CAN_TXBAR_AR0_Pos)
#define CAN_TXBAR_AR1_Msk (_U_(0x1) << CAN_TXBAR_AR1_Pos)
#define CAN_TXBAR_AR2_Msk (_U_(0x1) << CAN_TXBAR_AR2_Pos)
#define CAN_TXBAR_AR3_Msk (_U_(0x1) << CAN_TXBAR_AR3_Pos)
#define CAN_TXBAR_AR4_Msk (_U_(0x1) << CAN_TXBAR_AR4_Pos)
#define CAN_TXBAR_AR5_Msk (_U_(0x1) << CAN_TXBAR_AR5_Pos)
#define CAN_TXBAR_AR6_Msk (_U_(0x1) << CAN_TXBAR_AR6_Pos)
#define CAN_TXBAR_AR7_Msk (_U_(0x1) << CAN_TXBAR_AR7_Pos)
#define CAN_TXBAR_AR8_Msk (_U_(0x1) << CAN_TXBAR_AR8_Pos)
#define CAN_TXBAR_AR9_Msk (_U_(0x1) << CAN_TXBAR_AR9_Pos)
#define CAN_TXBAR_AR10_Msk (_U_(0x1) << CAN_TXBAR_AR10_Pos)
#define CAN_TXBAR_AR11_Msk (_U_(0x1) << CAN_TXBAR_AR11_Pos)
#define CAN_TXBAR_AR12_Msk (_U_(0x1) << CAN_TXBAR_AR12_Pos)
#define CAN_TXBAR_AR13_Msk (_U_(0x1) << CAN_TXBAR_AR13_Pos)
