dylad/RIOT/cpu/sam0_common/include/vendor/same51/include/compat_same51.h
#define RTC_TAMPCTRL_DEBNC1_Msk (_U_(0x1) << RTC_TAMPCTRL_DEBNC1_Pos)
#define RTC_TAMPCTRL_DEBNC2_Msk (_U_(0x1) << RTC_TAMPCTRL_DEBNC2_Pos)
#define RTC_TAMPCTRL_DEBNC3_Msk (_U_(0x1) << RTC_TAMPCTRL_DEBNC3_Pos)
#define RTC_TAMPCTRL_DEBNC4_Msk (_U_(0x1) << RTC_TAMPCTRL_DEBNC4_Pos)
#define RTC_TAMPID_TAMPID0_Msk (_U_(0x1) << RTC_TAMPID_TAMPID0_Pos)
#define RTC_TAMPID_TAMPID1_Msk (_U_(0x1) << RTC_TAMPID_TAMPID1_Pos)
#define RTC_TAMPID_TAMPID2_Msk (_U_(0x1) << RTC_TAMPID_TAMPID2_Pos)
#define RTC_TAMPID_TAMPID3_Msk (_U_(0x1) << RTC_TAMPID_TAMPID3_Pos)
#define RTC_TAMPID_TAMPID4_Msk (_U_(0x1) << RTC_TAMPID_TAMPID4_Pos)
#define RTC_TAMPID_TAMPEVT_Msk (_U_(0x1) << RTC_TAMPID_TAMPEVT_Pos)
#define RTC_MODE0_CTRLA_Msk RTC_MODE0_CTRLA_MASK
#define RTC_MODE1_CTRLA_Msk RTC_MODE1_CTRLA_MASK
#define RTC_MODE2_CTRLA_Msk RTC_MODE2_CTRLA_MASK
#define RTC_MODE0_CTRLB_Msk RTC_MODE0_CTRLB_MASK
#define RTC_MODE1_CTRLB_Msk RTC_MODE1_CTRLB_MASK
#define RTC_MODE2_CTRLB_Msk RTC_MODE2_CTRLB_MASK
#define RTC_MODE0_EVCTRL_Msk RTC_MODE0_EVCTRL_MASK
#define RTC_MODE1_EVCTRL_Msk RTC_MODE1_EVCTRL_MASK
#define RTC_MODE2_EVCTRL_Msk RTC_MODE2_EVCTRL_MASK
#define RTC_MODE0_INTENCLR_Msk RTC_MODE0_INTENCLR_MASK
#define RTC_MODE1_INTENCLR_Msk RTC_MODE1_INTENCLR_MASK
#define RTC_MODE2_INTENCLR_Msk RTC_MODE2_INTENCLR_MASK
#define RTC_MODE0_INTENSET_Msk RTC_MODE0_INTENSET_MASK
#define RTC_MODE1_INTENSET_Msk RTC_MODE1_INTENSET_MASK
#define RTC_MODE2_INTENSET_Msk RTC_MODE2_INTENSET_MASK
#define RTC_MODE0_INTFLAG_Msk RTC_MODE0_INTFLAG_MASK
#define RTC_MODE1_INTFLAG_Msk RTC_MODE1_INTFLAG_MASK
#define RTC_MODE2_INTFLAG_Msk RTC_MODE2_INTFLAG_MASK
#define RTC_DBGCTRL_Msk RTC_DBGCTRL_MASK
#define RTC_MODE0_SYNCBUSY_Msk RTC_MODE0_SYNCBUSY_MASK
#define RTC_MODE1_SYNCBUSY_Msk RTC_MODE1_SYNCBUSY_MASK
#define RTC_MODE2_SYNCBUSY_Msk RTC_MODE2_SYNCBUSY_MASK
#define RTC_FREQCORR_Msk RTC_FREQCORR_MASK
#define RTC_MODE0_COUNT_Msk RTC_MODE0_COUNT_MASK
#define RTC_MODE1_COUNT_Msk RTC_MODE1_COUNT_MASK
#define RTC_MODE2_CLOCK_Msk RTC_MODE2_CLOCK_MASK
#define RTC_MODE1_PER_Msk RTC_MODE1_PER_MASK
#define RTC_MODE0_COMP_Msk RTC_MODE0_COMP_MASK
#define RTC_MODE1_COMP_Msk RTC_MODE1_COMP_MASK
#define RTC_MODE2_ALARM_Msk RTC_MODE2_ALARM_MASK
#define RTC_MODE2_Msk RTC_MODE2_MASK
#define RTC_MODE2_MASK_Msk RTC_MODE2_MASK_MASK
#define RTC_GP_Msk RTC_GP_MASK
#define RTC_TAMPCTRL_Msk RTC_TAMPCTRL_MASK
#define RTC_MODE0_TIMESTAMP_Msk RTC_MODE0_TIMESTAMP_MASK
#define RTC_MODE1_TIMESTAMP_Msk RTC_MODE1_TIMESTAMP_MASK
#define RTC_MODE2_TIMESTAMP_Msk RTC_MODE2_TIMESTAMP_MASK
#define RTC_TAMPID_Msk RTC_TAMPID_MASK
#define RTC_BKUP_Msk RTC_BKUP_MASK
#define SDHC_TMR_DMAEN_Msk (_U_(0x1) << SDHC_TMR_DMAEN_Pos)
#define SDHC_TMR_BCEN_Msk (_U_(0x1) << SDHC_TMR_BCEN_Pos)
#define SDHC_TMR_DTDSEL_Msk (_U_(0x1) << SDHC_TMR_DTDSEL_Pos)
#define SDHC_TMR_MSBSEL_Msk (_U_(0x1) << SDHC_TMR_MSBSEL_Pos)
#define SDHC_CR_CMDCCEN_Msk (_U_(0x1) << SDHC_CR_CMDCCEN_Pos)
#define SDHC_CR_CMDICEN_Msk (_U_(0x1) << SDHC_CR_CMDICEN_Pos)
#define SDHC_CR_DPSEL_Msk (_U_(0x1) << SDHC_CR_DPSEL_Pos)
#define SDHC_PSR_CMDINHC_Msk (_U_(0x1) << SDHC_PSR_CMDINHC_Pos)
#define SDHC_PSR_CMDINHD_Msk (_U_(0x1) << SDHC_PSR_CMDINHD_Pos)
#define SDHC_PSR_DLACT_Msk (_U_(0x1) << SDHC_PSR_DLACT_Pos)
#define SDHC_PSR_RTREQ_Msk (_U_(0x1) << SDHC_PSR_RTREQ_Pos)
#define SDHC_PSR_WTACT_Msk (_U_(0x1) << SDHC_PSR_WTACT_Pos)
#define SDHC_PSR_RTACT_Msk (_U_(0x1) << SDHC_PSR_RTACT_Pos)
#define SDHC_PSR_BUFWREN_Msk (_U_(0x1) << SDHC_PSR_BUFWREN_Pos)
#define SDHC_PSR_BUFRDEN_Msk (_U_(0x1) << SDHC_PSR_BUFRDEN_Pos)
#define SDHC_PSR_CARDINS_Msk (_U_(0x1) << SDHC_PSR_CARDINS_Pos)
#define SDHC_PSR_CARDSS_Msk (_U_(0x1) << SDHC_PSR_CARDSS_Pos)
#define SDHC_PSR_CARDDPL_Msk (_U_(0x1) << SDHC_PSR_CARDDPL_Pos)
#define SDHC_PSR_WRPPL_Msk (_U_(0x1) << SDHC_PSR_WRPPL_Pos)
#define SDHC_PSR_CMDLL_Msk (_U_(0x1) << SDHC_PSR_CMDLL_Pos)
#define SDHC_HC1R_LEDCTRL_Msk (_U_(0x1) << SDHC_HC1R_LEDCTRL_Pos)
#define SDHC_HC1R_DW_Msk (_U_(0x1) << SDHC_HC1R_DW_Pos)
#define SDHC_HC1R_HSEN_Msk (_U_(0x1) << SDHC_HC1R_HSEN_Pos)
#define SDHC_HC1R_CARDDTL_Msk (_U_(0x1) << SDHC_HC1R_CARDDTL_Pos)
#define SDHC_HC1R_CARDDSEL_Msk (_U_(0x1) << SDHC_HC1R_CARDDSEL_Pos)
#define SDHC_HC1R_EMMC_DW_Msk (_U_(0x1) << SDHC_HC1R_EMMC_DW_Pos)
#define SDHC_HC1R_EMMC_HSEN_Msk (_U_(0x1) << SDHC_HC1R_EMMC_HSEN_Pos)
#define SDHC_PCR_SDBPWR_Msk (_U_(0x1) << SDHC_PCR_SDBPWR_Pos)
#define SDHC_BGCR_STPBGR_Msk (_U_(0x1) << SDHC_BGCR_STPBGR_Pos)
#define SDHC_BGCR_CONTR_Msk (_U_(0x1) << SDHC_BGCR_CONTR_Pos)
#define SDHC_BGCR_RWCTRL_Msk (_U_(0x1) << SDHC_BGCR_RWCTRL_Pos)
#define SDHC_BGCR_INTBG_Msk (_U_(0x1) << SDHC_BGCR_INTBG_Pos)
#define SDHC_BGCR_EMMC_STPBGR_Msk (_U_(0x1) << SDHC_BGCR_EMMC_STPBGR_Pos)
#define SDHC_BGCR_EMMC_CONTR_Msk (_U_(0x1) << SDHC_BGCR_EMMC_CONTR_Pos)
#define SDHC_WCR_WKENCINT_Msk (_U_(0x1) << SDHC_WCR_WKENCINT_Pos)
#define SDHC_WCR_WKENCINS_Msk (_U_(0x1) << SDHC_WCR_WKENCINS_Pos)
#define SDHC_WCR_WKENCREM_Msk (_U_(0x1) << SDHC_WCR_WKENCREM_Pos)
#define SDHC_CCR_INTCLKEN_Msk (_U_(0x1) << SDHC_CCR_INTCLKEN_Pos)
#define SDHC_CCR_INTCLKS_Msk (_U_(0x1) << SDHC_CCR_INTCLKS_Pos)
#define SDHC_CCR_SDCLKEN_Msk (_U_(0x1) << SDHC_CCR_SDCLKEN_Pos)
#define SDHC_CCR_CLKGSEL_Msk (_U_(0x1) << SDHC_CCR_CLKGSEL_Pos)
#define SDHC_SRR_SWRSTALL_Msk (_U_(0x1) << SDHC_SRR_SWRSTALL_Pos)
#define SDHC_SRR_SWRSTCMD_Msk (_U_(0x1) << SDHC_SRR_SWRSTCMD_Pos)
#define SDHC_SRR_SWRSTDAT_Msk (_U_(0x1) << SDHC_SRR_SWRSTDAT_Pos)
#define SDHC_NISTR_CMDC_Msk (_U_(0x1) << SDHC_NISTR_CMDC_Pos)
#define SDHC_NISTR_TRFC_Msk (_U_(0x1) << SDHC_NISTR_TRFC_Pos)
#define SDHC_NISTR_BLKGE_Msk (_U_(0x1) << SDHC_NISTR_BLKGE_Pos)
#define SDHC_NISTR_DMAINT_Msk (_U_(0x1) << SDHC_NISTR_DMAINT_Pos)
#define SDHC_NISTR_BWRRDY_Msk (_U_(0x1) << SDHC_NISTR_BWRRDY_Pos)
#define SDHC_NISTR_BRDRDY_Msk (_U_(0x1) << SDHC_NISTR_BRDRDY_Pos)
#define SDHC_NISTR_CINS_Msk (_U_(0x1) << SDHC_NISTR_CINS_Pos)
#define SDHC_NISTR_CREM_Msk (_U_(0x1) << SDHC_NISTR_CREM_Pos)
#define SDHC_NISTR_CINT_Msk (_U_(0x1) << SDHC_NISTR_CINT_Pos)
#define SDHC_NISTR_ERRINT_Msk (_U_(0x1) << SDHC_NISTR_ERRINT_Pos)
#define SDHC_NISTR_EMMC_CMDC_Msk (_U_(0x1) << SDHC_NISTR_EMMC_CMDC_Pos)
#define SDHC_NISTR_EMMC_TRFC_Msk (_U_(0x1) << SDHC_NISTR_EMMC_TRFC_Pos)
#define SDHC_NISTR_EMMC_BLKGE_Msk (_U_(0x1) << SDHC_NISTR_EMMC_BLKGE_Pos)
#define SDHC_NISTR_EMMC_DMAINT_Msk (_U_(0x1) << SDHC_NISTR_EMMC_DMAINT_Pos)
#define SDHC_NISTR_EMMC_BWRRDY_Msk (_U_(0x1) << SDHC_NISTR_EMMC_BWRRDY_Pos)
#define SDHC_NISTR_EMMC_BRDRDY_Msk (_U_(0x1) << SDHC_NISTR_EMMC_BRDRDY_Pos)
#define SDHC_NISTR_EMMC_BOOTAR_Msk (_U_(0x1) << SDHC_NISTR_EMMC_BOOTAR_Pos)
#define SDHC_NISTR_EMMC_ERRINT_Msk (_U_(0x1) << SDHC_NISTR_EMMC_ERRINT_Pos)
#define SDHC_EISTR_CMDTEO_Msk (_U_(0x1) << SDHC_EISTR_CMDTEO_Pos)
#define SDHC_EISTR_CMDCRC_Msk (_U_(0x1) << SDHC_EISTR_CMDCRC_Pos)
#define SDHC_EISTR_CMDEND_Msk (_U_(0x1) << SDHC_EISTR_CMDEND_Pos)
#define SDHC_EISTR_CMDIDX_Msk (_U_(0x1) << SDHC_EISTR_CMDIDX_Pos)
#define SDHC_EISTR_DATTEO_Msk (_U_(0x1) << SDHC_EISTR_DATTEO_Pos)
#define SDHC_EISTR_DATCRC_Msk (_U_(0x1) << SDHC_EISTR_DATCRC_Pos)
#define SDHC_EISTR_DATEND_Msk (_U_(0x1) << SDHC_EISTR_DATEND_Pos)
#define SDHC_EISTR_CURLIM_Msk (_U_(0x1) << SDHC_EISTR_CURLIM_Pos)
#define SDHC_EISTR_ACMD_Msk (_U_(0x1) << SDHC_EISTR_ACMD_Pos)
#define SDHC_EISTR_ADMA_Msk (_U_(0x1) << SDHC_EISTR_ADMA_Pos)
#define SDHC_EISTR_EMMC_CMDTEO_Msk (_U_(0x1) << SDHC_EISTR_EMMC_CMDTEO_Pos)
#define SDHC_EISTR_EMMC_CMDCRC_Msk (_U_(0x1) << SDHC_EISTR_EMMC_CMDCRC_Pos)
#define SDHC_EISTR_EMMC_CMDEND_Msk (_U_(0x1) << SDHC_EISTR_EMMC_CMDEND_Pos)
#define SDHC_EISTR_EMMC_CMDIDX_Msk (_U_(0x1) << SDHC_EISTR_EMMC_CMDIDX_Pos)
#define SDHC_EISTR_EMMC_DATTEO_Msk (_U_(0x1) << SDHC_EISTR_EMMC_DATTEO_Pos)
#define SDHC_EISTR_EMMC_DATCRC_Msk (_U_(0x1) << SDHC_EISTR_EMMC_DATCRC_Pos)
#define SDHC_EISTR_EMMC_DATEND_Msk (_U_(0x1) << SDHC_EISTR_EMMC_DATEND_Pos)
#define SDHC_EISTR_EMMC_CURLIM_Msk (_U_(0x1) << SDHC_EISTR_EMMC_CURLIM_Pos)
#define SDHC_EISTR_EMMC_ACMD_Msk (_U_(0x1) << SDHC_EISTR_EMMC_ACMD_Pos)
#define SDHC_EISTR_EMMC_ADMA_Msk (_U_(0x1) << SDHC_EISTR_EMMC_ADMA_Pos)
#define SDHC_EISTR_EMMC_BOOTAE_Msk (_U_(0x1) << SDHC_EISTR_EMMC_BOOTAE_Pos)
#define SDHC_NISTER_CMDC_Msk (_U_(0x1) << SDHC_NISTER_CMDC_Pos)
#define SDHC_NISTER_TRFC_Msk (_U_(0x1) << SDHC_NISTER_TRFC_Pos)
#define SDHC_NISTER_BLKGE_Msk (_U_(0x1) << SDHC_NISTER_BLKGE_Pos)
#define SDHC_NISTER_DMAINT_Msk (_U_(0x1) << SDHC_NISTER_DMAINT_Pos)
#define SDHC_NISTER_BWRRDY_Msk (_U_(0x1) << SDHC_NISTER_BWRRDY_Pos)
#define SDHC_NISTER_BRDRDY_Msk (_U_(0x1) << SDHC_NISTER_BRDRDY_Pos)
#define SDHC_NISTER_CINS_Msk (_U_(0x1) << SDHC_NISTER_CINS_Pos)
#define SDHC_NISTER_CREM_Msk (_U_(0x1) << SDHC_NISTER_CREM_Pos)
#define SDHC_NISTER_CINT_Msk (_U_(0x1) << SDHC_NISTER_CINT_Pos)
#define SDHC_NISTER_EMMC_CMDC_Msk (_U_(0x1) << SDHC_NISTER_EMMC_CMDC_Pos)
#define SDHC_NISTER_EMMC_TRFC_Msk (_U_(0x1) << SDHC_NISTER_EMMC_TRFC_Pos)
#define SDHC_NISTER_EMMC_BLKGE_Msk (_U_(0x1) << SDHC_NISTER_EMMC_BLKGE_Pos)
#define SDHC_NISTER_EMMC_DMAINT_Msk (_U_(0x1) << SDHC_NISTER_EMMC_DMAINT_Pos)
#define SDHC_NISTER_EMMC_BWRRDY_Msk (_U_(0x1) << SDHC_NISTER_EMMC_BWRRDY_Pos)
#define SDHC_NISTER_EMMC_BRDRDY_Msk (_U_(0x1) << SDHC_NISTER_EMMC_BRDRDY_Pos)
#define SDHC_NISTER_EMMC_BOOTAR_Msk (_U_(0x1) << SDHC_NISTER_EMMC_BOOTAR_Pos)
#define SDHC_EISTER_CMDTEO_Msk (_U_(0x1) << SDHC_EISTER_CMDTEO_Pos)
#define SDHC_EISTER_CMDCRC_Msk (_U_(0x1) << SDHC_EISTER_CMDCRC_Pos)
#define SDHC_EISTER_CMDEND_Msk (_U_(0x1) << SDHC_EISTER_CMDEND_Pos)
#define SDHC_EISTER_CMDIDX_Msk (_U_(0x1) << SDHC_EISTER_CMDIDX_Pos)
#define SDHC_EISTER_DATTEO_Msk (_U_(0x1) << SDHC_EISTER_DATTEO_Pos)
#define SDHC_EISTER_DATCRC_Msk (_U_(0x1) << SDHC_EISTER_DATCRC_Pos)
#define SDHC_EISTER_DATEND_Msk (_U_(0x1) << SDHC_EISTER_DATEND_Pos)
#define SDHC_EISTER_CURLIM_Msk (_U_(0x1) << SDHC_EISTER_CURLIM_Pos)
#define SDHC_EISTER_ACMD_Msk (_U_(0x1) << SDHC_EISTER_ACMD_Pos)
#define SDHC_EISTER_ADMA_Msk (_U_(0x1) << SDHC_EISTER_ADMA_Pos)
#define SDHC_EISTER_EMMC_CMDTEO_Msk (_U_(0x1) << SDHC_EISTER_EMMC_CMDTEO_Pos)
#define SDHC_EISTER_EMMC_CMDCRC_Msk (_U_(0x1) << SDHC_EISTER_EMMC_CMDCRC_Pos)
#define SDHC_EISTER_EMMC_CMDEND_Msk (_U_(0x1) << SDHC_EISTER_EMMC_CMDEND_Pos)
#define SDHC_EISTER_EMMC_CMDIDX_Msk (_U_(0x1) << SDHC_EISTER_EMMC_CMDIDX_Pos)
#define SDHC_EISTER_EMMC_DATTEO_Msk (_U_(0x1) << SDHC_EISTER_EMMC_DATTEO_Pos)
#define SDHC_EISTER_EMMC_DATCRC_Msk (_U_(0x1) << SDHC_EISTER_EMMC_DATCRC_Pos)
#define SDHC_EISTER_EMMC_DATEND_Msk (_U_(0x1) << SDHC_EISTER_EMMC_DATEND_Pos)
#define SDHC_EISTER_EMMC_CURLIM_Msk (_U_(0x1) << SDHC_EISTER_EMMC_CURLIM_Pos)
#define SDHC_EISTER_EMMC_ACMD_Msk (_U_(0x1) << SDHC_EISTER_EMMC_ACMD_Pos)
#define SDHC_EISTER_EMMC_ADMA_Msk (_U_(0x1) << SDHC_EISTER_EMMC_ADMA_Pos)
#define SDHC_EISTER_EMMC_BOOTAE_Msk (_U_(0x1) << SDHC_EISTER_EMMC_BOOTAE_Pos)
#define SDHC_NISIER_CMDC_Msk (_U_(0x1) << SDHC_NISIER_CMDC_Pos)
#define SDHC_NISIER_TRFC_Msk (_U_(0x1) << SDHC_NISIER_TRFC_Pos)
#define SDHC_NISIER_BLKGE_Msk (_U_(0x1) << SDHC_NISIER_BLKGE_Pos)
#define SDHC_NISIER_DMAINT_Msk (_U_(0x1) << SDHC_NISIER_DMAINT_Pos)
#define SDHC_NISIER_BWRRDY_Msk (_U_(0x1) << SDHC_NISIER_BWRRDY_Pos)
#define SDHC_NISIER_BRDRDY_Msk (_U_(0x1) << SDHC_NISIER_BRDRDY_Pos)
#define SDHC_NISIER_CINS_Msk (_U_(0x1) << SDHC_NISIER_CINS_Pos)
#define SDHC_NISIER_CREM_Msk (_U_(0x1) << SDHC_NISIER_CREM_Pos)
#define SDHC_NISIER_CINT_Msk (_U_(0x1) << SDHC_NISIER_CINT_Pos)
#define SDHC_NISIER_EMMC_CMDC_Msk (_U_(0x1) << SDHC_NISIER_EMMC_CMDC_Pos)
#define SDHC_NISIER_EMMC_TRFC_Msk (_U_(0x1) << SDHC_NISIER_EMMC_TRFC_Pos)
#define SDHC_NISIER_EMMC_BLKGE_Msk (_U_(0x1) << SDHC_NISIER_EMMC_BLKGE_Pos)
#define SDHC_NISIER_EMMC_DMAINT_Msk (_U_(0x1) << SDHC_NISIER_EMMC_DMAINT_Pos)
#define SDHC_NISIER_EMMC_BWRRDY_Msk (_U_(0x1) << SDHC_NISIER_EMMC_BWRRDY_Pos)
#define SDHC_NISIER_EMMC_BRDRDY_Msk (_U_(0x1) << SDHC_NISIER_EMMC_BRDRDY_Pos)
#define SDHC_NISIER_EMMC_BOOTAR_Msk (_U_(0x1) << SDHC_NISIER_EMMC_BOOTAR_Pos)
#define SDHC_EISIER_CMDTEO_Msk (_U_(0x1) << SDHC_EISIER_CMDTEO_Pos)
#define SDHC_EISIER_CMDCRC_Msk (_U_(0x1) << SDHC_EISIER_CMDCRC_Pos)
#define SDHC_EISIER_CMDEND_Msk (_U_(0x1) << SDHC_EISIER_CMDEND_Pos)
#define SDHC_EISIER_CMDIDX_Msk (_U_(0x1) << SDHC_EISIER_CMDIDX_Pos)
#define SDHC_EISIER_DATTEO_Msk (_U_(0x1) << SDHC_EISIER_DATTEO_Pos)
#define SDHC_EISIER_DATCRC_Msk (_U_(0x1) << SDHC_EISIER_DATCRC_Pos)
#define SDHC_EISIER_DATEND_Msk (_U_(0x1) << SDHC_EISIER_DATEND_Pos)
#define SDHC_EISIER_CURLIM_Msk (_U_(0x1) << SDHC_EISIER_CURLIM_Pos)
#define SDHC_EISIER_ACMD_Msk (_U_(0x1) << SDHC_EISIER_ACMD_Pos)
#define SDHC_EISIER_ADMA_Msk (_U_(0x1) << SDHC_EISIER_ADMA_Pos)
#define SDHC_EISIER_EMMC_CMDTEO_Msk (_U_(0x1) << SDHC_EISIER_EMMC_CMDTEO_Pos)
#define SDHC_EISIER_EMMC_CMDCRC_Msk (_U_(0x1) << SDHC_EISIER_EMMC_CMDCRC_Pos)
#define SDHC_EISIER_EMMC_CMDEND_Msk (_U_(0x1) << SDHC_EISIER_EMMC_CMDEND_Pos)
#define SDHC_EISIER_EMMC_CMDIDX_Msk (_U_(0x1) << SDHC_EISIER_EMMC_CMDIDX_Pos)
#define SDHC_EISIER_EMMC_DATTEO_Msk (_U_(0x1) << SDHC_EISIER_EMMC_DATTEO_Pos)
#define SDHC_EISIER_EMMC_DATCRC_Msk (_U_(0x1) << SDHC_EISIER_EMMC_DATCRC_Pos)
#define SDHC_EISIER_EMMC_DATEND_Msk (_U_(0x1) << SDHC_EISIER_EMMC_DATEND_Pos)
#define SDHC_EISIER_EMMC_CURLIM_Msk (_U_(0x1) << SDHC_EISIER_EMMC_CURLIM_Pos)
#define SDHC_EISIER_EMMC_ACMD_Msk (_U_(0x1) << SDHC_EISIER_EMMC_ACMD_Pos)
#define SDHC_EISIER_EMMC_ADMA_Msk (_U_(0x1) << SDHC_EISIER_EMMC_ADMA_Pos)
#define SDHC_EISIER_EMMC_BOOTAE_Msk (_U_(0x1) << SDHC_EISIER_EMMC_BOOTAE_Pos)
#define SDHC_ACESR_ACMD12NE_Msk (_U_(0x1) << SDHC_ACESR_ACMD12NE_Pos)
#define SDHC_ACESR_ACMDTEO_Msk (_U_(0x1) << SDHC_ACESR_ACMDTEO_Pos)
#define SDHC_ACESR_ACMDCRC_Msk (_U_(0x1) << SDHC_ACESR_ACMDCRC_Pos)
#define SDHC_ACESR_ACMDEND_Msk (_U_(0x1) << SDHC_ACESR_ACMDEND_Pos)
#define SDHC_ACESR_ACMDIDX_Msk (_U_(0x1) << SDHC_ACESR_ACMDIDX_Pos)
#define SDHC_ACESR_CMDNI_Msk (_U_(0x1) << SDHC_ACESR_CMDNI_Pos)
#define SDHC_HC2R_VS18EN_Msk (_U_(0x1) << SDHC_HC2R_VS18EN_Pos)
#define SDHC_HC2R_EXTUN_Msk (_U_(0x1) << SDHC_HC2R_EXTUN_Pos)
#define SDHC_HC2R_SLCKSEL_Msk (_U_(0x1) << SDHC_HC2R_SLCKSEL_Pos)
#define SDHC_HC2R_ASINTEN_Msk (_U_(0x1) << SDHC_HC2R_ASINTEN_Pos)
#define SDHC_HC2R_PVALEN_Msk (_U_(0x1) << SDHC_HC2R_PVALEN_Pos)
#define SDHC_HC2R_EMMC_EXTUN_Msk (_U_(0x1) << SDHC_HC2R_EMMC_EXTUN_Pos)
#define SDHC_HC2R_EMMC_SLCKSEL_Msk (_U_(0x1) << SDHC_HC2R_EMMC_SLCKSEL_Pos)
#define SDHC_HC2R_EMMC_PVALEN_Msk (_U_(0x1) << SDHC_HC2R_EMMC_PVALEN_Pos)
#define SDHC_CA0R_TEOCLKU_Msk (_U_(0x1) << SDHC_CA0R_TEOCLKU_Pos)
#define SDHC_CA0R_ED8SUP_Msk (_U_(0x1) << SDHC_CA0R_ED8SUP_Pos)
#define SDHC_CA0R_ADMA2SUP_Msk (_U_(0x1) << SDHC_CA0R_ADMA2SUP_Pos)
#define SDHC_CA0R_HSSUP_Msk (_U_(0x1) << SDHC_CA0R_HSSUP_Pos)
#define SDHC_CA0R_SDMASUP_Msk (_U_(0x1) << SDHC_CA0R_SDMASUP_Pos)
#define SDHC_CA0R_SRSUP_Msk (_U_(0x1) << SDHC_CA0R_SRSUP_Pos)
#define SDHC_CA0R_V33VSUP_Msk (_U_(0x1) << SDHC_CA0R_V33VSUP_Pos)
#define SDHC_CA0R_V30VSUP_Msk (_U_(0x1) << SDHC_CA0R_V30VSUP_Pos)
#define SDHC_CA0R_V18VSUP_Msk (_U_(0x1) << SDHC_CA0R_V18VSUP_Pos)
#define SDHC_CA0R_SB64SUP_Msk (_U_(0x1) << SDHC_CA0R_SB64SUP_Pos)
#define SDHC_CA0R_ASINTSUP_Msk (_U_(0x1) << SDHC_CA0R_ASINTSUP_Pos)
#define SDHC_CA1R_SDR50SUP_Msk (_U_(0x1) << SDHC_CA1R_SDR50SUP_Pos)
#define SDHC_CA1R_SDR104SUP_Msk (_U_(0x1) << SDHC_CA1R_SDR104SUP_Pos)
#define SDHC_CA1R_DDR50SUP_Msk (_U_(0x1) << SDHC_CA1R_DDR50SUP_Pos)
#define SDHC_CA1R_DRVASUP_Msk (_U_(0x1) << SDHC_CA1R_DRVASUP_Pos)
#define SDHC_CA1R_DRVCSUP_Msk (_U_(0x1) << SDHC_CA1R_DRVCSUP_Pos)
#define SDHC_CA1R_DRVDSUP_Msk (_U_(0x1) << SDHC_CA1R_DRVDSUP_Pos)
#define SDHC_CA1R_TSDR50_Msk (_U_(0x1) << SDHC_CA1R_TSDR50_Pos)
#define SDHC_FERACES_ACMD12NE_Msk (_U_(0x1) << SDHC_FERACES_ACMD12NE_Pos)
#define SDHC_FERACES_ACMDTEO_Msk (_U_(0x1) << SDHC_FERACES_ACMDTEO_Pos)
#define SDHC_FERACES_ACMDCRC_Msk (_U_(0x1) << SDHC_FERACES_ACMDCRC_Pos)
#define SDHC_FERACES_ACMDEND_Msk (_U_(0x1) << SDHC_FERACES_ACMDEND_Pos)
#define SDHC_FERACES_ACMDIDX_Msk (_U_(0x1) << SDHC_FERACES_ACMDIDX_Pos)
#define SDHC_FERACES_CMDNI_Msk (_U_(0x1) << SDHC_FERACES_CMDNI_Pos)
#define SDHC_FEREIS_CMDTEO_Msk (_U_(0x1) << SDHC_FEREIS_CMDTEO_Pos)
#define SDHC_FEREIS_CMDCRC_Msk (_U_(0x1) << SDHC_FEREIS_CMDCRC_Pos)
#define SDHC_FEREIS_CMDEND_Msk (_U_(0x1) << SDHC_FEREIS_CMDEND_Pos)
#define SDHC_FEREIS_CMDIDX_Msk (_U_(0x1) << SDHC_FEREIS_CMDIDX_Pos)
#define SDHC_FEREIS_DATTEO_Msk (_U_(0x1) << SDHC_FEREIS_DATTEO_Pos)
#define SDHC_FEREIS_DATCRC_Msk (_U_(0x1) << SDHC_FEREIS_DATCRC_Pos)
#define SDHC_FEREIS_DATEND_Msk (_U_(0x1) << SDHC_FEREIS_DATEND_Pos)
#define SDHC_FEREIS_CURLIM_Msk (_U_(0x1) << SDHC_FEREIS_CURLIM_Pos)
#define SDHC_FEREIS_ACMD_Msk (_U_(0x1) << SDHC_FEREIS_ACMD_Pos)
#define SDHC_FEREIS_ADMA_Msk (_U_(0x1) << SDHC_FEREIS_ADMA_Pos)
#define SDHC_FEREIS_BOOTAE_Msk (_U_(0x1) << SDHC_FEREIS_BOOTAE_Pos)
#define SDHC_AESR_LMIS_Msk (_U_(0x1) << SDHC_AESR_LMIS_Pos)
#define SDHC_PVR_CLKGSEL_Msk (_U_(0x1) << SDHC_PVR_CLKGSEL_Pos)
#define SDHC_MC1R_DDR_Msk (_U_(0x1) << SDHC_MC1R_DDR_Pos)
#define SDHC_MC1R_OPD_Msk (_U_(0x1) << SDHC_MC1R_OPD_Pos)
#define SDHC_MC1R_BOOTA_Msk (_U_(0x1) << SDHC_MC1R_BOOTA_Pos)
#define SDHC_MC1R_RSTN_Msk (_U_(0x1) << SDHC_MC1R_RSTN_Pos)
#define SDHC_MC1R_FCD_Msk (_U_(0x1) << SDHC_MC1R_FCD_Pos)
#define SDHC_MC2R_SRESP_Msk (_U_(0x1) << SDHC_MC2R_SRESP_Pos)
#define SDHC_MC2R_ABOOT_Msk (_U_(0x1) << SDHC_MC2R_ABOOT_Pos)
#define SDHC_CC2R_FSDCLKD_Msk (_U_(0x1) << SDHC_CC2R_FSDCLKD_Pos)
#define SDHC_CACR_CAPWREN_Msk (_U_(0x1) << SDHC_CACR_CAPWREN_Pos)
#define SDHC_DBGR_NIDBG_Msk (_U_(0x1) << SDHC_DBGR_NIDBG_Pos)
#define SDHC_SSAR_CMD23_Msk SDHC_SSAR_CMD23_MASK
#define SDHC_SSAR_Msk SDHC_SSAR_MASK
#define SDHC_BSR_Msk SDHC_BSR_MASK
#define SDHC_BCR_Msk SDHC_BCR_MASK
#define SDHC_ARG1R_Msk SDHC_ARG1R_MASK
#define SDHC_TMR_Msk SDHC_TMR_MASK
#define SDHC_CR_Msk SDHC_CR_MASK
#define SDHC_RR_Msk SDHC_RR_MASK
#define SDHC_BDPR_Msk SDHC_BDPR_MASK
#define SDHC_PSR_Msk SDHC_PSR_MASK
#define SDHC_HC1R_Msk SDHC_HC1R_MASK
#define SDHC_HC1R_EMMC_Msk SDHC_HC1R_EMMC_MASK
#define SDHC_PCR_Msk SDHC_PCR_MASK
#define SDHC_BGCR_Msk SDHC_BGCR_MASK
#define SDHC_BGCR_EMMC_Msk SDHC_BGCR_EMMC_MASK
#define SDHC_WCR_Msk SDHC_WCR_MASK
#define SDHC_CCR_Msk SDHC_CCR_MASK
#define SDHC_TCR_Msk SDHC_TCR_MASK
#define SDHC_SRR_Msk SDHC_SRR_MASK
#define SDHC_NISTR_Msk SDHC_NISTR_MASK
#define SDHC_NISTR_EMMC_Msk SDHC_NISTR_EMMC_MASK
#define SDHC_EISTR_Msk SDHC_EISTR_MASK
#define SDHC_EISTR_EMMC_Msk SDHC_EISTR_EMMC_MASK
#define SDHC_NISTER_Msk SDHC_NISTER_MASK
#define SDHC_NISTER_EMMC_Msk SDHC_NISTER_EMMC_MASK
#define SDHC_EISTER_Msk SDHC_EISTER_MASK
#define SDHC_EISTER_EMMC_Msk SDHC_EISTER_EMMC_MASK
#define SDHC_NISIER_Msk SDHC_NISIER_MASK
#define SDHC_NISIER_EMMC_Msk SDHC_NISIER_EMMC_MASK
#define SDHC_EISIER_Msk SDHC_EISIER_MASK
#define SDHC_EISIER_EMMC_Msk SDHC_EISIER_EMMC_MASK
#define SDHC_ACESR_Msk SDHC_ACESR_MASK
#define SDHC_HC2R_Msk SDHC_HC2R_MASK
#define SDHC_HC2R_EMMC_Msk SDHC_HC2R_EMMC_MASK
#define SDHC_CA0R_Msk SDHC_CA0R_MASK
#define SDHC_CA1R_Msk SDHC_CA1R_MASK
#define SDHC_MCCAR_Msk SDHC_MCCAR_MASK
#define SDHC_FERACES_Msk SDHC_FERACES_MASK
#define SDHC_FEREIS_Msk SDHC_FEREIS_MASK
#define SDHC_AESR_Msk SDHC_AESR_MASK
#define SDHC_ASAR_Msk SDHC_ASAR_MASK
#define SDHC_PVR_Msk SDHC_PVR_MASK
#define SDHC_SISR_Msk SDHC_SISR_MASK
#define SDHC_HCVR_Msk SDHC_HCVR_MASK
#define SDHC_MC1R_Msk SDHC_MC1R_MASK
#define SDHC_MC2R_Msk SDHC_MC2R_MASK
#define SDHC_ACR_Msk SDHC_ACR_MASK
#define SDHC_CC2R_Msk SDHC_CC2R_MASK
#define SDHC_CACR_Msk SDHC_CACR_MASK
#define SDHC_DBGR_Msk SDHC_DBGR_MASK
#define SERCOM_I2CM_CTRLA_SWRST_Msk (_U_(0x1) << SERCOM_I2CM_CTRLA_SWRST_Pos)
#define SERCOM_I2CM_CTRLA_ENABLE_Msk (_U_(0x1) << SERCOM_I2CM_CTRLA_ENABLE_Pos)
#define SERCOM_I2CM_CTRLA_RUNSTDBY_Msk (_U_(0x1) << SERCOM_I2CM_CTRLA_RUNSTDBY_Pos)
#define SERCOM_I2CM_CTRLA_PINOUT_Msk (_U_(0x1) << SERCOM_I2CM_CTRLA_PINOUT_Pos)
#define SERCOM_I2CM_CTRLA_MEXTTOEN_Msk (_U_(0x1) << SERCOM_I2CM_CTRLA_MEXTTOEN_Pos)
#define SERCOM_I2CM_CTRLA_SEXTTOEN_Msk (_U_(0x1) << SERCOM_I2CM_CTRLA_SEXTTOEN_Pos)
#define SERCOM_I2CM_CTRLA_SCLSM_Msk (_U_(0x1) << SERCOM_I2CM_CTRLA_SCLSM_Pos)
#define SERCOM_I2CM_CTRLA_LOWTOUTEN_Msk (_U_(0x1) << SERCOM_I2CM_CTRLA_LOWTOUTEN_Pos)
#define SERCOM_I2CS_CTRLA_SWRST_Msk (_U_(0x1) << SERCOM_I2CS_CTRLA_SWRST_Pos)
#define SERCOM_I2CS_CTRLA_ENABLE_Msk (_U_(0x1) << SERCOM_I2CS_CTRLA_ENABLE_Pos)
#define SERCOM_I2CS_CTRLA_RUNSTDBY_Msk (_U_(0x1) << SERCOM_I2CS_CTRLA_RUNSTDBY_Pos)
#define SERCOM_I2CS_CTRLA_PINOUT_Msk (_U_(0x1) << SERCOM_I2CS_CTRLA_PINOUT_Pos)
#define SERCOM_I2CS_CTRLA_SEXTTOEN_Msk (_U_(0x1) << SERCOM_I2CS_CTRLA_SEXTTOEN_Pos)
#define SERCOM_I2CS_CTRLA_SCLSM_Msk (_U_(0x1) << SERCOM_I2CS_CTRLA_SCLSM_Pos)
#define SERCOM_I2CS_CTRLA_LOWTOUTEN_Msk (_U_(0x1) << SERCOM_I2CS_CTRLA_LOWTOUTEN_Pos)
#define SERCOM_SPI_CTRLA_SWRST_Msk (_U_(0x1) << SERCOM_SPI_CTRLA_SWRST_Pos)
#define SERCOM_SPI_CTRLA_ENABLE_Msk (_U_(0x1) << SERCOM_SPI_CTRLA_ENABLE_Pos)
#define SERCOM_SPI_CTRLA_RUNSTDBY_Msk (_U_(0x1) << SERCOM_SPI_CTRLA_RUNSTDBY_Pos)
#define SERCOM_SPI_CTRLA_IBON_Msk (_U_(0x1) << SERCOM_SPI_CTRLA_IBON_Pos)
#define SERCOM_SPI_CTRLA_CPHA_Msk (_U_(0x1) << SERCOM_SPI_CTRLA_CPHA_Pos)
#define SERCOM_SPI_CTRLA_CPOL_Msk (_U_(0x1) << SERCOM_SPI_CTRLA_CPOL_Pos)
#define SERCOM_SPI_CTRLA_DORD_Msk (_U_(0x1) << SERCOM_SPI_CTRLA_DORD_Pos)
#define SERCOM_USART_CTRLA_SWRST_Msk (_U_(0x1) << SERCOM_USART_CTRLA_SWRST_Pos)
#define SERCOM_USART_CTRLA_ENABLE_Msk (_U_(0x1) << SERCOM_USART_CTRLA_ENABLE_Pos)
#define SERCOM_USART_CTRLA_RUNSTDBY_Msk (_U_(0x1) << SERCOM_USART_CTRLA_RUNSTDBY_Pos)
#define SERCOM_USART_CTRLA_IBON_Msk (_U_(0x1) << SERCOM_USART_CTRLA_IBON_Pos)
#define SERCOM_USART_CTRLA_TXINV_Msk (_U_(0x1) << SERCOM_USART_CTRLA_TXINV_Pos)
#define SERCOM_USART_CTRLA_RXINV_Msk (_U_(0x1) << SERCOM_USART_CTRLA_RXINV_Pos)
#define SERCOM_USART_CTRLA_CMODE_Msk (_U_(0x1) << SERCOM_USART_CTRLA_CMODE_Pos)
#define SERCOM_USART_CTRLA_CPOL_Msk (_U_(0x1) << SERCOM_USART_CTRLA_CPOL_Pos)
#define SERCOM_USART_CTRLA_DORD_Msk (_U_(0x1) << SERCOM_USART_CTRLA_DORD_Pos)
#define SERCOM_I2CM_CTRLB_SMEN_Msk (_U_(0x1) << SERCOM_I2CM_CTRLB_SMEN_Pos)
#define SERCOM_I2CM_CTRLB_QCEN_Msk (_U_(0x1) << SERCOM_I2CM_CTRLB_QCEN_Pos)
#define SERCOM_I2CM_CTRLB_ACKACT_Msk (_U_(0x1) << SERCOM_I2CM_CTRLB_ACKACT_Pos)
#define SERCOM_I2CS_CTRLB_SMEN_Msk (_U_(0x1) << SERCOM_I2CS_CTRLB_SMEN_Pos)
#define SERCOM_I2CS_CTRLB_GCMD_Msk (_U_(0x1) << SERCOM_I2CS_CTRLB_GCMD_Pos)
#define SERCOM_I2CS_CTRLB_AACKEN_Msk (_U_(0x1) << SERCOM_I2CS_CTRLB_AACKEN_Pos)
#define SERCOM_I2CS_CTRLB_ACKACT_Msk (_U_(0x1) << SERCOM_I2CS_CTRLB_ACKACT_Pos)
#define SERCOM_SPI_CTRLB_PLOADEN_Msk (_U_(0x1) << SERCOM_SPI_CTRLB_PLOADEN_Pos)
#define SERCOM_SPI_CTRLB_SSDE_Msk (_U_(0x1) << SERCOM_SPI_CTRLB_SSDE_Pos)
#define SERCOM_SPI_CTRLB_MSSEN_Msk (_U_(0x1) << SERCOM_SPI_CTRLB_MSSEN_Pos)
#define SERCOM_SPI_CTRLB_RXEN_Msk (_U_(0x1) << SERCOM_SPI_CTRLB_RXEN_Pos)
#define SERCOM_USART_CTRLB_SBMODE_Msk (_U_(0x1) << SERCOM_USART_CTRLB_SBMODE_Pos)
#define SERCOM_USART_CTRLB_COLDEN_Msk (_U_(0x1) << SERCOM_USART_CTRLB_COLDEN_Pos)
#define SERCOM_USART_CTRLB_SFDE_Msk (_U_(0x1) << SERCOM_USART_CTRLB_SFDE_Pos)
#define SERCOM_USART_CTRLB_ENC_Msk (_U_(0x1) << SERCOM_USART_CTRLB_ENC_Pos)
#define SERCOM_USART_CTRLB_PMODE_Msk (_U_(0x1) << SERCOM_USART_CTRLB_PMODE_Pos)
#define SERCOM_USART_CTRLB_TXEN_Msk (_U_(0x1) << SERCOM_USART_CTRLB_TXEN_Pos)
#define SERCOM_USART_CTRLB_RXEN_Msk (_U_(0x1) << SERCOM_USART_CTRLB_RXEN_Pos)
#define SERCOM_I2CM_CTRLC_DATA32B_Msk (_U_(0x1) << SERCOM_I2CM_CTRLC_DATA32B_Pos)
#define SERCOM_I2CS_CTRLC_DATA32B_Msk (_U_(0x1) << SERCOM_I2CS_CTRLC_DATA32B_Pos)
#define SERCOM_SPI_CTRLC_DATA32B_Msk (_U_(0x1) << SERCOM_SPI_CTRLC_DATA32B_Pos)
#define SERCOM_USART_CTRLC_INACK_Msk (_U_(0x1) << SERCOM_USART_CTRLC_INACK_Pos)
#define SERCOM_USART_CTRLC_DSNACK_Msk (_U_(0x1) << SERCOM_USART_CTRLC_DSNACK_Pos)
#define SERCOM_I2CM_INTENCLR_MB_Msk (_U_(0x1) << SERCOM_I2CM_INTENCLR_MB_Pos)
#define SERCOM_I2CM_INTENCLR_SB_Msk (_U_(0x1) << SERCOM_I2CM_INTENCLR_SB_Pos)
#define SERCOM_I2CM_INTENCLR_ERROR_Msk (_U_(0x1) << SERCOM_I2CM_INTENCLR_ERROR_Pos)
