dylad/RIOT/cpu/sam0_common/include/vendor/same51/include/compat_same51.h
#define TCC_EVCTRL_MCEI5_Msk (_U_(0x1) << TCC_EVCTRL_MCEI5_Pos)
#define TCC_EVCTRL_MCEO0_Msk (_U_(0x1) << TCC_EVCTRL_MCEO0_Pos)
#define TCC_EVCTRL_MCEO1_Msk (_U_(0x1) << TCC_EVCTRL_MCEO1_Pos)
#define TCC_EVCTRL_MCEO2_Msk (_U_(0x1) << TCC_EVCTRL_MCEO2_Pos)
#define TCC_EVCTRL_MCEO3_Msk (_U_(0x1) << TCC_EVCTRL_MCEO3_Pos)
#define TCC_EVCTRL_MCEO4_Msk (_U_(0x1) << TCC_EVCTRL_MCEO4_Pos)
#define TCC_EVCTRL_MCEO5_Msk (_U_(0x1) << TCC_EVCTRL_MCEO5_Pos)
#define TCC_INTENCLR_OVF_Msk (_U_(0x1) << TCC_INTENCLR_OVF_Pos)
#define TCC_INTENCLR_TRG_Msk (_U_(0x1) << TCC_INTENCLR_TRG_Pos)
#define TCC_INTENCLR_CNT_Msk (_U_(0x1) << TCC_INTENCLR_CNT_Pos)
#define TCC_INTENCLR_ERR_Msk (_U_(0x1) << TCC_INTENCLR_ERR_Pos)
#define TCC_INTENCLR_UFS_Msk (_U_(0x1) << TCC_INTENCLR_UFS_Pos)
#define TCC_INTENCLR_DFS_Msk (_U_(0x1) << TCC_INTENCLR_DFS_Pos)
#define TCC_INTENCLR_FAULTA_Msk (_U_(0x1) << TCC_INTENCLR_FAULTA_Pos)
#define TCC_INTENCLR_FAULTB_Msk (_U_(0x1) << TCC_INTENCLR_FAULTB_Pos)
#define TCC_INTENCLR_FAULT0_Msk (_U_(0x1) << TCC_INTENCLR_FAULT0_Pos)
#define TCC_INTENCLR_FAULT1_Msk (_U_(0x1) << TCC_INTENCLR_FAULT1_Pos)
#define TCC_INTENCLR_MC0_Msk (_U_(0x1) << TCC_INTENCLR_MC0_Pos)
#define TCC_INTENCLR_MC1_Msk (_U_(0x1) << TCC_INTENCLR_MC1_Pos)
#define TCC_INTENCLR_MC2_Msk (_U_(0x1) << TCC_INTENCLR_MC2_Pos)
#define TCC_INTENCLR_MC3_Msk (_U_(0x1) << TCC_INTENCLR_MC3_Pos)
#define TCC_INTENCLR_MC4_Msk (_U_(0x1) << TCC_INTENCLR_MC4_Pos)
#define TCC_INTENCLR_MC5_Msk (_U_(0x1) << TCC_INTENCLR_MC5_Pos)
#define TCC_INTENSET_OVF_Msk (_U_(0x1) << TCC_INTENSET_OVF_Pos)
#define TCC_INTENSET_TRG_Msk (_U_(0x1) << TCC_INTENSET_TRG_Pos)
#define TCC_INTENSET_CNT_Msk (_U_(0x1) << TCC_INTENSET_CNT_Pos)
#define TCC_INTENSET_ERR_Msk (_U_(0x1) << TCC_INTENSET_ERR_Pos)
#define TCC_INTENSET_UFS_Msk (_U_(0x1) << TCC_INTENSET_UFS_Pos)
#define TCC_INTENSET_DFS_Msk (_U_(0x1) << TCC_INTENSET_DFS_Pos)
#define TCC_INTENSET_FAULTA_Msk (_U_(0x1) << TCC_INTENSET_FAULTA_Pos)
#define TCC_INTENSET_FAULTB_Msk (_U_(0x1) << TCC_INTENSET_FAULTB_Pos)
#define TCC_INTENSET_FAULT0_Msk (_U_(0x1) << TCC_INTENSET_FAULT0_Pos)
#define TCC_INTENSET_FAULT1_Msk (_U_(0x1) << TCC_INTENSET_FAULT1_Pos)
#define TCC_INTENSET_MC0_Msk (_U_(0x1) << TCC_INTENSET_MC0_Pos)
#define TCC_INTENSET_MC1_Msk (_U_(0x1) << TCC_INTENSET_MC1_Pos)
#define TCC_INTENSET_MC2_Msk (_U_(0x1) << TCC_INTENSET_MC2_Pos)
#define TCC_INTENSET_MC3_Msk (_U_(0x1) << TCC_INTENSET_MC3_Pos)
#define TCC_INTENSET_MC4_Msk (_U_(0x1) << TCC_INTENSET_MC4_Pos)
#define TCC_INTENSET_MC5_Msk (_U_(0x1) << TCC_INTENSET_MC5_Pos)
#define TCC_INTFLAG_OVF_Msk (_U_(0x1) << TCC_INTFLAG_OVF_Pos)
#define TCC_INTFLAG_TRG_Msk (_U_(0x1) << TCC_INTFLAG_TRG_Pos)
#define TCC_INTFLAG_CNT_Msk (_U_(0x1) << TCC_INTFLAG_CNT_Pos)
#define TCC_INTFLAG_ERR_Msk (_U_(0x1) << TCC_INTFLAG_ERR_Pos)
#define TCC_INTFLAG_UFS_Msk (_U_(0x1) << TCC_INTFLAG_UFS_Pos)
#define TCC_INTFLAG_DFS_Msk (_U_(0x1) << TCC_INTFLAG_DFS_Pos)
#define TCC_INTFLAG_FAULTA_Msk (_U_(0x1) << TCC_INTFLAG_FAULTA_Pos)
#define TCC_INTFLAG_FAULTB_Msk (_U_(0x1) << TCC_INTFLAG_FAULTB_Pos)
#define TCC_INTFLAG_FAULT0_Msk (_U_(0x1) << TCC_INTFLAG_FAULT0_Pos)
#define TCC_INTFLAG_FAULT1_Msk (_U_(0x1) << TCC_INTFLAG_FAULT1_Pos)
#define TCC_INTFLAG_MC0_Msk (_U_(0x1) << TCC_INTFLAG_MC0_Pos)
#define TCC_INTFLAG_MC1_Msk (_U_(0x1) << TCC_INTFLAG_MC1_Pos)
#define TCC_INTFLAG_MC2_Msk (_U_(0x1) << TCC_INTFLAG_MC2_Pos)
#define TCC_INTFLAG_MC3_Msk (_U_(0x1) << TCC_INTFLAG_MC3_Pos)
#define TCC_INTFLAG_MC4_Msk (_U_(0x1) << TCC_INTFLAG_MC4_Pos)
#define TCC_INTFLAG_MC5_Msk (_U_(0x1) << TCC_INTFLAG_MC5_Pos)
#define TCC_STATUS_STOP_Msk (_U_(0x1) << TCC_STATUS_STOP_Pos)
#define TCC_STATUS_IDX_Msk (_U_(0x1) << TCC_STATUS_IDX_Pos)
#define TCC_STATUS_UFS_Msk (_U_(0x1) << TCC_STATUS_UFS_Pos)
#define TCC_STATUS_DFS_Msk (_U_(0x1) << TCC_STATUS_DFS_Pos)
#define TCC_STATUS_SLAVE_Msk (_U_(0x1) << TCC_STATUS_SLAVE_Pos)
#define TCC_STATUS_PATTBUFV_Msk (_U_(0x1) << TCC_STATUS_PATTBUFV_Pos)
#define TCC_STATUS_PERBUFV_Msk (_U_(0x1) << TCC_STATUS_PERBUFV_Pos)
#define TCC_STATUS_FAULTAIN_Msk (_U_(0x1) << TCC_STATUS_FAULTAIN_Pos)
#define TCC_STATUS_FAULTBIN_Msk (_U_(0x1) << TCC_STATUS_FAULTBIN_Pos)
#define TCC_STATUS_FAULT0IN_Msk (_U_(0x1) << TCC_STATUS_FAULT0IN_Pos)
#define TCC_STATUS_FAULT1IN_Msk (_U_(0x1) << TCC_STATUS_FAULT1IN_Pos)
#define TCC_STATUS_FAULTA_Msk (_U_(0x1) << TCC_STATUS_FAULTA_Pos)
#define TCC_STATUS_FAULTB_Msk (_U_(0x1) << TCC_STATUS_FAULTB_Pos)
#define TCC_STATUS_FAULT0_Msk (_U_(0x1) << TCC_STATUS_FAULT0_Pos)
#define TCC_STATUS_FAULT1_Msk (_U_(0x1) << TCC_STATUS_FAULT1_Pos)
#define TCC_STATUS_CCBUFV0_Msk (_U_(0x1) << TCC_STATUS_CCBUFV0_Pos)
#define TCC_STATUS_CCBUFV1_Msk (_U_(0x1) << TCC_STATUS_CCBUFV1_Pos)
#define TCC_STATUS_CCBUFV2_Msk (_U_(0x1) << TCC_STATUS_CCBUFV2_Pos)
#define TCC_STATUS_CCBUFV3_Msk (_U_(0x1) << TCC_STATUS_CCBUFV3_Pos)
#define TCC_STATUS_CCBUFV4_Msk (_U_(0x1) << TCC_STATUS_CCBUFV4_Pos)
#define TCC_STATUS_CCBUFV5_Msk (_U_(0x1) << TCC_STATUS_CCBUFV5_Pos)
#define TCC_STATUS_CMP0_Msk (_U_(0x1) << TCC_STATUS_CMP0_Pos)
#define TCC_STATUS_CMP1_Msk (_U_(0x1) << TCC_STATUS_CMP1_Pos)
#define TCC_STATUS_CMP2_Msk (_U_(0x1) << TCC_STATUS_CMP2_Pos)
#define TCC_STATUS_CMP3_Msk (_U_(0x1) << TCC_STATUS_CMP3_Pos)
#define TCC_STATUS_CMP4_Msk (_U_(0x1) << TCC_STATUS_CMP4_Pos)
#define TCC_STATUS_CMP5_Msk (_U_(0x1) << TCC_STATUS_CMP5_Pos)
#define TCC_PATT_PGE0_Msk (_U_(0x1) << TCC_PATT_PGE0_Pos)
#define TCC_PATT_PGE1_Msk (_U_(0x1) << TCC_PATT_PGE1_Pos)
#define TCC_PATT_PGE2_Msk (_U_(0x1) << TCC_PATT_PGE2_Pos)
#define TCC_PATT_PGE3_Msk (_U_(0x1) << TCC_PATT_PGE3_Pos)
#define TCC_PATT_PGE4_Msk (_U_(0x1) << TCC_PATT_PGE4_Pos)
#define TCC_PATT_PGE5_Msk (_U_(0x1) << TCC_PATT_PGE5_Pos)
#define TCC_PATT_PGE6_Msk (_U_(0x1) << TCC_PATT_PGE6_Pos)
#define TCC_PATT_PGE7_Msk (_U_(0x1) << TCC_PATT_PGE7_Pos)
#define TCC_PATT_PGV0_Msk (_U_(0x1) << TCC_PATT_PGV0_Pos)
#define TCC_PATT_PGV1_Msk (_U_(0x1) << TCC_PATT_PGV1_Pos)
#define TCC_PATT_PGV2_Msk (_U_(0x1) << TCC_PATT_PGV2_Pos)
#define TCC_PATT_PGV3_Msk (_U_(0x1) << TCC_PATT_PGV3_Pos)
#define TCC_PATT_PGV4_Msk (_U_(0x1) << TCC_PATT_PGV4_Pos)
#define TCC_PATT_PGV5_Msk (_U_(0x1) << TCC_PATT_PGV5_Pos)
#define TCC_PATT_PGV6_Msk (_U_(0x1) << TCC_PATT_PGV6_Pos)
#define TCC_PATT_PGV7_Msk (_U_(0x1) << TCC_PATT_PGV7_Pos)
#define TCC_WAVE_CIPEREN_Msk (_U_(0x1) << TCC_WAVE_CIPEREN_Pos)
#define TCC_WAVE_CICCEN0_Msk (_U_(0x1) << TCC_WAVE_CICCEN0_Pos)
#define TCC_WAVE_CICCEN1_Msk (_U_(0x1) << TCC_WAVE_CICCEN1_Pos)
#define TCC_WAVE_CICCEN2_Msk (_U_(0x1) << TCC_WAVE_CICCEN2_Pos)
#define TCC_WAVE_CICCEN3_Msk (_U_(0x1) << TCC_WAVE_CICCEN3_Pos)
#define TCC_WAVE_POL0_Msk (_U_(0x1) << TCC_WAVE_POL0_Pos)
#define TCC_WAVE_POL1_Msk (_U_(0x1) << TCC_WAVE_POL1_Pos)
#define TCC_WAVE_POL2_Msk (_U_(0x1) << TCC_WAVE_POL2_Pos)
#define TCC_WAVE_POL3_Msk (_U_(0x1) << TCC_WAVE_POL3_Pos)
#define TCC_WAVE_POL4_Msk (_U_(0x1) << TCC_WAVE_POL4_Pos)
#define TCC_WAVE_POL5_Msk (_U_(0x1) << TCC_WAVE_POL5_Pos)
#define TCC_WAVE_SWAP0_Msk (_U_(0x1) << TCC_WAVE_SWAP0_Pos)
#define TCC_WAVE_SWAP1_Msk (_U_(0x1) << TCC_WAVE_SWAP1_Pos)
#define TCC_WAVE_SWAP2_Msk (_U_(0x1) << TCC_WAVE_SWAP2_Pos)
#define TCC_WAVE_SWAP3_Msk (_U_(0x1) << TCC_WAVE_SWAP3_Pos)
#define TCC_PATTBUF_PGEB0_Msk (_U_(0x1) << TCC_PATTBUF_PGEB0_Pos)
#define TCC_PATTBUF_PGEB1_Msk (_U_(0x1) << TCC_PATTBUF_PGEB1_Pos)
#define TCC_PATTBUF_PGEB2_Msk (_U_(0x1) << TCC_PATTBUF_PGEB2_Pos)
#define TCC_PATTBUF_PGEB3_Msk (_U_(0x1) << TCC_PATTBUF_PGEB3_Pos)
#define TCC_PATTBUF_PGEB4_Msk (_U_(0x1) << TCC_PATTBUF_PGEB4_Pos)
#define TCC_PATTBUF_PGEB5_Msk (_U_(0x1) << TCC_PATTBUF_PGEB5_Pos)
#define TCC_PATTBUF_PGEB6_Msk (_U_(0x1) << TCC_PATTBUF_PGEB6_Pos)
#define TCC_PATTBUF_PGEB7_Msk (_U_(0x1) << TCC_PATTBUF_PGEB7_Pos)
#define TCC_PATTBUF_PGVB0_Msk (_U_(0x1) << TCC_PATTBUF_PGVB0_Pos)
#define TCC_PATTBUF_PGVB1_Msk (_U_(0x1) << TCC_PATTBUF_PGVB1_Pos)
#define TCC_PATTBUF_PGVB2_Msk (_U_(0x1) << TCC_PATTBUF_PGVB2_Pos)
#define TCC_PATTBUF_PGVB3_Msk (_U_(0x1) << TCC_PATTBUF_PGVB3_Pos)
#define TCC_PATTBUF_PGVB4_Msk (_U_(0x1) << TCC_PATTBUF_PGVB4_Pos)
#define TCC_PATTBUF_PGVB5_Msk (_U_(0x1) << TCC_PATTBUF_PGVB5_Pos)
#define TCC_PATTBUF_PGVB6_Msk (_U_(0x1) << TCC_PATTBUF_PGVB6_Pos)
#define TCC_PATTBUF_PGVB7_Msk (_U_(0x1) << TCC_PATTBUF_PGVB7_Pos)
#define TCC_CTRLA_Msk TCC_CTRLA_MASK
#define TCC_CTRLBCLR_Msk TCC_CTRLBCLR_MASK
#define TCC_CTRLBSET_Msk TCC_CTRLBSET_MASK
#define TCC_SYNCBUSY_Msk TCC_SYNCBUSY_MASK
#define TCC_FCTRLA_Msk TCC_FCTRLA_MASK
#define TCC_FCTRLB_Msk TCC_FCTRLB_MASK
#define TCC_WEXCTRL_Msk TCC_WEXCTRL_MASK
#define TCC_DRVCTRL_Msk TCC_DRVCTRL_MASK
#define TCC_DBGCTRL_Msk TCC_DBGCTRL_MASK
#define TCC_EVCTRL_Msk TCC_EVCTRL_MASK
#define TCC_INTENCLR_Msk TCC_INTENCLR_MASK
#define TCC_INTENSET_Msk TCC_INTENSET_MASK
#define TCC_INTFLAG_Msk TCC_INTFLAG_MASK
#define TCC_STATUS_Msk TCC_STATUS_MASK
#define TCC_COUNT_DITH4_Msk TCC_COUNT_DITH4_MASK
#define TCC_COUNT_DITH5_Msk TCC_COUNT_DITH5_MASK
#define TCC_COUNT_DITH6_Msk TCC_COUNT_DITH6_MASK
#define TCC_COUNT_Msk TCC_COUNT_MASK
#define TCC_PATT_Msk TCC_PATT_MASK
#define TCC_WAVE_Msk TCC_WAVE_MASK
#define TCC_PER_DITH4_Msk TCC_PER_DITH4_MASK
#define TCC_PER_DITH5_Msk TCC_PER_DITH5_MASK
#define TCC_PER_DITH6_Msk TCC_PER_DITH6_MASK
#define TCC_PER_Msk TCC_PER_MASK
#define TCC_CC_DITH4_Msk TCC_CC_DITH4_MASK
#define TCC_CC_DITH5_Msk TCC_CC_DITH5_MASK
#define TCC_CC_DITH6_Msk TCC_CC_DITH6_MASK
#define TCC_CC_Msk TCC_CC_MASK
#define TCC_PATTBUF_Msk TCC_PATTBUF_MASK
#define TCC_PERBUF_DITH4_Msk TCC_PERBUF_DITH4_MASK
#define TCC_PERBUF_DITH5_Msk TCC_PERBUF_DITH5_MASK
#define TCC_PERBUF_DITH6_Msk TCC_PERBUF_DITH6_MASK
#define TCC_PERBUF_Msk TCC_PERBUF_MASK
#define TCC_CCBUF_DITH4_Msk TCC_CCBUF_DITH4_MASK
#define TCC_CCBUF_DITH5_Msk TCC_CCBUF_DITH5_MASK
#define TCC_CCBUF_DITH6_Msk TCC_CCBUF_DITH6_MASK
#define TCC_CCBUF_Msk TCC_CCBUF_MASK
#define TRNG_CTRLA_ENABLE_Msk (_U_(0x1) << TRNG_CTRLA_ENABLE_Pos)
#define TRNG_CTRLA_RUNSTDBY_Msk (_U_(0x1) << TRNG_CTRLA_RUNSTDBY_Pos)
#define TRNG_EVCTRL_DATARDYEO_Msk (_U_(0x1) << TRNG_EVCTRL_DATARDYEO_Pos)
#define TRNG_INTENCLR_DATARDY_Msk (_U_(0x1) << TRNG_INTENCLR_DATARDY_Pos)
#define TRNG_INTENSET_DATARDY_Msk (_U_(0x1) << TRNG_INTENSET_DATARDY_Pos)
#define TRNG_INTFLAG_DATARDY_Msk (_U_(0x1) << TRNG_INTFLAG_DATARDY_Pos)
#define TRNG_CTRLA_Msk TRNG_CTRLA_MASK
#define TRNG_EVCTRL_Msk TRNG_EVCTRL_MASK
#define TRNG_INTENCLR_Msk TRNG_INTENCLR_MASK
#define TRNG_INTENSET_Msk TRNG_INTENSET_MASK
#define TRNG_INTFLAG_Msk TRNG_INTFLAG_MASK
#define TRNG_DATA_Msk TRNG_DATA_MASK
#define USB_CTRLA_SWRST_Msk (_U_(0x1) << USB_CTRLA_SWRST_Pos)
#define USB_CTRLA_ENABLE_Msk (_U_(0x1) << USB_CTRLA_ENABLE_Pos)
#define USB_CTRLA_RUNSTDBY_Msk (_U_(0x1) << USB_CTRLA_RUNSTDBY_Pos)
#define USB_CTRLA_MODE_Msk (_U_(0x1) << USB_CTRLA_MODE_Pos)
#define USB_SYNCBUSY_SWRST_Msk (_U_(0x1) << USB_SYNCBUSY_SWRST_Pos)
#define USB_SYNCBUSY_ENABLE_Msk (_U_(0x1) << USB_SYNCBUSY_ENABLE_Pos)
#define USB_DEVICE_CTRLB_DETACH_Msk (_U_(0x1) << USB_DEVICE_CTRLB_DETACH_Pos)
#define USB_DEVICE_CTRLB_UPRSM_Msk (_U_(0x1) << USB_DEVICE_CTRLB_UPRSM_Pos)
#define USB_DEVICE_CTRLB_NREPLY_Msk (_U_(0x1) << USB_DEVICE_CTRLB_NREPLY_Pos)
#define USB_DEVICE_CTRLB_TSTJ_Msk (_U_(0x1) << USB_DEVICE_CTRLB_TSTJ_Pos)
#define USB_DEVICE_CTRLB_TSTK_Msk (_U_(0x1) << USB_DEVICE_CTRLB_TSTK_Pos)
#define USB_DEVICE_CTRLB_TSTPCKT_Msk (_U_(0x1) << USB_DEVICE_CTRLB_TSTPCKT_Pos)
#define USB_DEVICE_CTRLB_OPMODE2_Msk (_U_(0x1) << USB_DEVICE_CTRLB_OPMODE2_Pos)
#define USB_DEVICE_CTRLB_GNAK_Msk (_U_(0x1) << USB_DEVICE_CTRLB_GNAK_Pos)
#define USB_HOST_CTRLB_RESUME_Msk (_U_(0x1) << USB_HOST_CTRLB_RESUME_Pos)
#define USB_HOST_CTRLB_AUTORESUME_Msk (_U_(0x1) << USB_HOST_CTRLB_AUTORESUME_Pos)
#define USB_HOST_CTRLB_TSTJ_Msk (_U_(0x1) << USB_HOST_CTRLB_TSTJ_Pos)
#define USB_HOST_CTRLB_TSTK_Msk (_U_(0x1) << USB_HOST_CTRLB_TSTK_Pos)
#define USB_HOST_CTRLB_SOFE_Msk (_U_(0x1) << USB_HOST_CTRLB_SOFE_Pos)
#define USB_HOST_CTRLB_BUSRESET_Msk (_U_(0x1) << USB_HOST_CTRLB_BUSRESET_Pos)
#define USB_HOST_CTRLB_VBUSOK_Msk (_U_(0x1) << USB_HOST_CTRLB_VBUSOK_Pos)
#define USB_HOST_CTRLB_L1RESUME_Msk (_U_(0x1) << USB_HOST_CTRLB_L1RESUME_Pos)
#define USB_DEVICE_DADD_ADDEN_Msk (_U_(0x1) << USB_DEVICE_DADD_ADDEN_Pos)
#define USB_HOST_HSOFC_FLENCE_Msk (_U_(0x1) << USB_HOST_HSOFC_FLENCE_Pos)
#define USB_DEVICE_FNUM_FNCERR_Msk (_U_(0x1) << USB_DEVICE_FNUM_FNCERR_Pos)
#define USB_DEVICE_INTENCLR_SUSPEND_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_SUSPEND_Pos)
#define USB_DEVICE_INTENCLR_MSOF_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_MSOF_Pos)
#define USB_DEVICE_INTENCLR_SOF_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_SOF_Pos)
#define USB_DEVICE_INTENCLR_EORST_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_EORST_Pos)
#define USB_DEVICE_INTENCLR_WAKEUP_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_WAKEUP_Pos)
#define USB_DEVICE_INTENCLR_EORSM_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_EORSM_Pos)
#define USB_DEVICE_INTENCLR_UPRSM_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_UPRSM_Pos)
#define USB_DEVICE_INTENCLR_RAMACER_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_RAMACER_Pos)
#define USB_DEVICE_INTENCLR_LPMNYET_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_LPMNYET_Pos)
#define USB_DEVICE_INTENCLR_LPMSUSP_Msk (_U_(0x1) << USB_DEVICE_INTENCLR_LPMSUSP_Pos)
#define USB_HOST_INTENCLR_HSOF_Msk (_U_(0x1) << USB_HOST_INTENCLR_HSOF_Pos)
#define USB_HOST_INTENCLR_RST_Msk (_U_(0x1) << USB_HOST_INTENCLR_RST_Pos)
#define USB_HOST_INTENCLR_WAKEUP_Msk (_U_(0x1) << USB_HOST_INTENCLR_WAKEUP_Pos)
#define USB_HOST_INTENCLR_DNRSM_Msk (_U_(0x1) << USB_HOST_INTENCLR_DNRSM_Pos)
#define USB_HOST_INTENCLR_UPRSM_Msk (_U_(0x1) << USB_HOST_INTENCLR_UPRSM_Pos)
#define USB_HOST_INTENCLR_RAMACER_Msk (_U_(0x1) << USB_HOST_INTENCLR_RAMACER_Pos)
#define USB_HOST_INTENCLR_DCONN_Msk (_U_(0x1) << USB_HOST_INTENCLR_DCONN_Pos)
#define USB_HOST_INTENCLR_DDISC_Msk (_U_(0x1) << USB_HOST_INTENCLR_DDISC_Pos)
#define USB_DEVICE_INTENSET_SUSPEND_Msk (_U_(0x1) << USB_DEVICE_INTENSET_SUSPEND_Pos)
#define USB_DEVICE_INTENSET_MSOF_Msk (_U_(0x1) << USB_DEVICE_INTENSET_MSOF_Pos)
#define USB_DEVICE_INTENSET_SOF_Msk (_U_(0x1) << USB_DEVICE_INTENSET_SOF_Pos)
#define USB_DEVICE_INTENSET_EORST_Msk (_U_(0x1) << USB_DEVICE_INTENSET_EORST_Pos)
#define USB_DEVICE_INTENSET_WAKEUP_Msk (_U_(0x1) << USB_DEVICE_INTENSET_WAKEUP_Pos)
#define USB_DEVICE_INTENSET_EORSM_Msk (_U_(0x1) << USB_DEVICE_INTENSET_EORSM_Pos)
#define USB_DEVICE_INTENSET_UPRSM_Msk (_U_(0x1) << USB_DEVICE_INTENSET_UPRSM_Pos)
#define USB_DEVICE_INTENSET_RAMACER_Msk (_U_(0x1) << USB_DEVICE_INTENSET_RAMACER_Pos)
#define USB_DEVICE_INTENSET_LPMNYET_Msk (_U_(0x1) << USB_DEVICE_INTENSET_LPMNYET_Pos)
#define USB_DEVICE_INTENSET_LPMSUSP_Msk (_U_(0x1) << USB_DEVICE_INTENSET_LPMSUSP_Pos)
#define USB_HOST_INTENSET_HSOF_Msk (_U_(0x1) << USB_HOST_INTENSET_HSOF_Pos)
#define USB_HOST_INTENSET_RST_Msk (_U_(0x1) << USB_HOST_INTENSET_RST_Pos)
#define USB_HOST_INTENSET_WAKEUP_Msk (_U_(0x1) << USB_HOST_INTENSET_WAKEUP_Pos)
#define USB_HOST_INTENSET_DNRSM_Msk (_U_(0x1) << USB_HOST_INTENSET_DNRSM_Pos)
#define USB_HOST_INTENSET_UPRSM_Msk (_U_(0x1) << USB_HOST_INTENSET_UPRSM_Pos)
#define USB_HOST_INTENSET_RAMACER_Msk (_U_(0x1) << USB_HOST_INTENSET_RAMACER_Pos)
#define USB_HOST_INTENSET_DCONN_Msk (_U_(0x1) << USB_HOST_INTENSET_DCONN_Pos)
#define USB_HOST_INTENSET_DDISC_Msk (_U_(0x1) << USB_HOST_INTENSET_DDISC_Pos)
#define USB_DEVICE_INTFLAG_SUSPEND_Msk (_U_(0x1) << USB_DEVICE_INTFLAG_SUSPEND_Pos)
#define USB_DEVICE_INTFLAG_MSOF_Msk (_U_(0x1) << USB_DEVICE_INTFLAG_MSOF_Pos)
#define USB_DEVICE_INTFLAG_SOF_Msk (_U_(0x1) << USB_DEVICE_INTFLAG_SOF_Pos)
#define USB_DEVICE_INTFLAG_EORST_Msk (_U_(0x1) << USB_DEVICE_INTFLAG_EORST_Pos)
#define USB_DEVICE_INTFLAG_WAKEUP_Msk (_U_(0x1) << USB_DEVICE_INTFLAG_WAKEUP_Pos)
#define USB_DEVICE_INTFLAG_EORSM_Msk (_U_(0x1) << USB_DEVICE_INTFLAG_EORSM_Pos)
#define USB_DEVICE_INTFLAG_UPRSM_Msk (_U_(0x1) << USB_DEVICE_INTFLAG_UPRSM_Pos)
#define USB_DEVICE_INTFLAG_RAMACER_Msk (_U_(0x1) << USB_DEVICE_INTFLAG_RAMACER_Pos)
#define USB_DEVICE_INTFLAG_LPMNYET_Msk (_U_(0x1) << USB_DEVICE_INTFLAG_LPMNYET_Pos)
#define USB_DEVICE_INTFLAG_LPMSUSP_Msk (_U_(0x1) << USB_DEVICE_INTFLAG_LPMSUSP_Pos)
#define USB_HOST_INTFLAG_HSOF_Msk (_U_(0x1) << USB_HOST_INTFLAG_HSOF_Pos)
#define USB_HOST_INTFLAG_RST_Msk (_U_(0x1) << USB_HOST_INTFLAG_RST_Pos)
#define USB_HOST_INTFLAG_WAKEUP_Msk (_U_(0x1) << USB_HOST_INTFLAG_WAKEUP_Pos)
#define USB_HOST_INTFLAG_DNRSM_Msk (_U_(0x1) << USB_HOST_INTFLAG_DNRSM_Pos)
#define USB_HOST_INTFLAG_UPRSM_Msk (_U_(0x1) << USB_HOST_INTFLAG_UPRSM_Pos)
#define USB_HOST_INTFLAG_RAMACER_Msk (_U_(0x1) << USB_HOST_INTFLAG_RAMACER_Pos)
#define USB_HOST_INTFLAG_DCONN_Msk (_U_(0x1) << USB_HOST_INTFLAG_DCONN_Pos)
#define USB_HOST_INTFLAG_DDISC_Msk (_U_(0x1) << USB_HOST_INTFLAG_DDISC_Pos)
#define USB_DEVICE_EPINTSMRY_EPINT0_Msk (_U_(0x1) << USB_DEVICE_EPINTSMRY_EPINT0_Pos)
#define USB_DEVICE_EPINTSMRY_EPINT1_Msk (_U_(0x1) << USB_DEVICE_EPINTSMRY_EPINT1_Pos)
#define USB_DEVICE_EPINTSMRY_EPINT2_Msk (_U_(0x1) << USB_DEVICE_EPINTSMRY_EPINT2_Pos)
#define USB_DEVICE_EPINTSMRY_EPINT3_Msk (_U_(0x1) << USB_DEVICE_EPINTSMRY_EPINT3_Pos)
#define USB_DEVICE_EPINTSMRY_EPINT4_Msk (_U_(0x1) << USB_DEVICE_EPINTSMRY_EPINT4_Pos)
#define USB_DEVICE_EPINTSMRY_EPINT5_Msk (_U_(0x1) << USB_DEVICE_EPINTSMRY_EPINT5_Pos)
#define USB_DEVICE_EPINTSMRY_EPINT6_Msk (_U_(0x1) << USB_DEVICE_EPINTSMRY_EPINT6_Pos)
#define USB_DEVICE_EPINTSMRY_EPINT7_Msk (_U_(0x1) << USB_DEVICE_EPINTSMRY_EPINT7_Pos)
#define USB_HOST_PINTSMRY_EPINT0_Msk (_U_(0x1) << USB_HOST_PINTSMRY_EPINT0_Pos)
#define USB_HOST_PINTSMRY_EPINT1_Msk (_U_(0x1) << USB_HOST_PINTSMRY_EPINT1_Pos)
#define USB_HOST_PINTSMRY_EPINT2_Msk (_U_(0x1) << USB_HOST_PINTSMRY_EPINT2_Pos)
#define USB_HOST_PINTSMRY_EPINT3_Msk (_U_(0x1) << USB_HOST_PINTSMRY_EPINT3_Pos)
#define USB_HOST_PINTSMRY_EPINT4_Msk (_U_(0x1) << USB_HOST_PINTSMRY_EPINT4_Pos)
#define USB_HOST_PINTSMRY_EPINT5_Msk (_U_(0x1) << USB_HOST_PINTSMRY_EPINT5_Pos)
#define USB_HOST_PINTSMRY_EPINT6_Msk (_U_(0x1) << USB_HOST_PINTSMRY_EPINT6_Pos)
#define USB_HOST_PINTSMRY_EPINT7_Msk (_U_(0x1) << USB_HOST_PINTSMRY_EPINT7_Pos)
#define USB_DEVICE_EPCFG_NYETDIS_Msk (_U_(0x1) << USB_DEVICE_EPCFG_NYETDIS_Pos)
#define USB_HOST_PCFG_BK_Msk (_U_(0x1) << USB_HOST_PCFG_BK_Pos)
#define USB_DEVICE_EPSTATUSCLR_DTGLOUT_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSCLR_DTGLOUT_Pos)
#define USB_DEVICE_EPSTATUSCLR_DTGLIN_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSCLR_DTGLIN_Pos)
#define USB_DEVICE_EPSTATUSCLR_CURBK_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSCLR_CURBK_Pos)
#define USB_DEVICE_EPSTATUSCLR_STALLRQ0_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSCLR_STALLRQ0_Pos)
#define USB_DEVICE_EPSTATUSCLR_STALLRQ1_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSCLR_STALLRQ1_Pos)
#define USB_DEVICE_EPSTATUSCLR_BK0RDY_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSCLR_BK0RDY_Pos)
#define USB_DEVICE_EPSTATUSCLR_BK1RDY_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSCLR_BK1RDY_Pos)
#define USB_HOST_PSTATUSCLR_DTGL_Msk (_U_(0x1) << USB_HOST_PSTATUSCLR_DTGL_Pos)
#define USB_HOST_PSTATUSCLR_CURBK_Msk (_U_(0x1) << USB_HOST_PSTATUSCLR_CURBK_Pos)
#define USB_HOST_PSTATUSCLR_PFREEZE_Msk (_U_(0x1) << USB_HOST_PSTATUSCLR_PFREEZE_Pos)
#define USB_HOST_PSTATUSCLR_BK0RDY_Msk (_U_(0x1) << USB_HOST_PSTATUSCLR_BK0RDY_Pos)
#define USB_HOST_PSTATUSCLR_BK1RDY_Msk (_U_(0x1) << USB_HOST_PSTATUSCLR_BK1RDY_Pos)
#define USB_DEVICE_EPSTATUSSET_DTGLOUT_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSSET_DTGLOUT_Pos)
#define USB_DEVICE_EPSTATUSSET_DTGLIN_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSSET_DTGLIN_Pos)
#define USB_DEVICE_EPSTATUSSET_CURBK_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSSET_CURBK_Pos)
#define USB_DEVICE_EPSTATUSSET_STALLRQ0_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSSET_STALLRQ0_Pos)
#define USB_DEVICE_EPSTATUSSET_STALLRQ1_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSSET_STALLRQ1_Pos)
#define USB_DEVICE_EPSTATUSSET_BK0RDY_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSSET_BK0RDY_Pos)
#define USB_DEVICE_EPSTATUSSET_BK1RDY_Msk (_U_(0x1) << USB_DEVICE_EPSTATUSSET_BK1RDY_Pos)
#define USB_HOST_PSTATUSSET_DTGL_Msk (_U_(0x1) << USB_HOST_PSTATUSSET_DTGL_Pos)
#define USB_HOST_PSTATUSSET_CURBK_Msk (_U_(0x1) << USB_HOST_PSTATUSSET_CURBK_Pos)
#define USB_HOST_PSTATUSSET_PFREEZE_Msk (_U_(0x1) << USB_HOST_PSTATUSSET_PFREEZE_Pos)
#define USB_HOST_PSTATUSSET_BK0RDY_Msk (_U_(0x1) << USB_HOST_PSTATUSSET_BK0RDY_Pos)
#define USB_HOST_PSTATUSSET_BK1RDY_Msk (_U_(0x1) << USB_HOST_PSTATUSSET_BK1RDY_Pos)
#define USB_DEVICE_EPSTATUS_DTGLOUT_Msk (_U_(0x1) << USB_DEVICE_EPSTATUS_DTGLOUT_Pos)
#define USB_DEVICE_EPSTATUS_DTGLIN_Msk (_U_(0x1) << USB_DEVICE_EPSTATUS_DTGLIN_Pos)
#define USB_DEVICE_EPSTATUS_CURBK_Msk (_U_(0x1) << USB_DEVICE_EPSTATUS_CURBK_Pos)
#define USB_DEVICE_EPSTATUS_STALLRQ0_Msk (_U_(0x1) << USB_DEVICE_EPSTATUS_STALLRQ0_Pos)
#define USB_DEVICE_EPSTATUS_STALLRQ1_Msk (_U_(0x1) << USB_DEVICE_EPSTATUS_STALLRQ1_Pos)
#define USB_DEVICE_EPSTATUS_BK0RDY_Msk (_U_(0x1) << USB_DEVICE_EPSTATUS_BK0RDY_Pos)
#define USB_DEVICE_EPSTATUS_BK1RDY_Msk (_U_(0x1) << USB_DEVICE_EPSTATUS_BK1RDY_Pos)
#define USB_HOST_PSTATUS_DTGL_Msk (_U_(0x1) << USB_HOST_PSTATUS_DTGL_Pos)
#define USB_HOST_PSTATUS_CURBK_Msk (_U_(0x1) << USB_HOST_PSTATUS_CURBK_Pos)
#define USB_HOST_PSTATUS_PFREEZE_Msk (_U_(0x1) << USB_HOST_PSTATUS_PFREEZE_Pos)
#define USB_HOST_PSTATUS_BK0RDY_Msk (_U_(0x1) << USB_HOST_PSTATUS_BK0RDY_Pos)
#define USB_HOST_PSTATUS_BK1RDY_Msk (_U_(0x1) << USB_HOST_PSTATUS_BK1RDY_Pos)
#define USB_DEVICE_EPINTFLAG_TRCPT0_Msk (_U_(0x1) << USB_DEVICE_EPINTFLAG_TRCPT0_Pos)
#define USB_DEVICE_EPINTFLAG_TRCPT1_Msk (_U_(0x1) << USB_DEVICE_EPINTFLAG_TRCPT1_Pos)
#define USB_DEVICE_EPINTFLAG_TRFAIL0_Msk (_U_(0x1) << USB_DEVICE_EPINTFLAG_TRFAIL0_Pos)
#define USB_DEVICE_EPINTFLAG_TRFAIL1_Msk (_U_(0x1) << USB_DEVICE_EPINTFLAG_TRFAIL1_Pos)
#define USB_DEVICE_EPINTFLAG_RXSTP_Msk (_U_(0x1) << USB_DEVICE_EPINTFLAG_RXSTP_Pos)
#define USB_DEVICE_EPINTFLAG_STALL0_Msk (_U_(0x1) << USB_DEVICE_EPINTFLAG_STALL0_Pos)
#define USB_DEVICE_EPINTFLAG_STALL1_Msk (_U_(0x1) << USB_DEVICE_EPINTFLAG_STALL1_Pos)
#define USB_HOST_PINTFLAG_TRCPT0_Msk (_U_(0x1) << USB_HOST_PINTFLAG_TRCPT0_Pos)
#define USB_HOST_PINTFLAG_TRCPT1_Msk (_U_(0x1) << USB_HOST_PINTFLAG_TRCPT1_Pos)
#define USB_HOST_PINTFLAG_TRFAIL_Msk (_U_(0x1) << USB_HOST_PINTFLAG_TRFAIL_Pos)
#define USB_HOST_PINTFLAG_PERR_Msk (_U_(0x1) << USB_HOST_PINTFLAG_PERR_Pos)
#define USB_HOST_PINTFLAG_TXSTP_Msk (_U_(0x1) << USB_HOST_PINTFLAG_TXSTP_Pos)
#define USB_HOST_PINTFLAG_STALL_Msk (_U_(0x1) << USB_HOST_PINTFLAG_STALL_Pos)
#define USB_DEVICE_EPINTENCLR_TRCPT0_Msk (_U_(0x1) << USB_DEVICE_EPINTENCLR_TRCPT0_Pos)
#define USB_DEVICE_EPINTENCLR_TRCPT1_Msk (_U_(0x1) << USB_DEVICE_EPINTENCLR_TRCPT1_Pos)
#define USB_DEVICE_EPINTENCLR_TRFAIL0_Msk (_U_(0x1) << USB_DEVICE_EPINTENCLR_TRFAIL0_Pos)
#define USB_DEVICE_EPINTENCLR_TRFAIL1_Msk (_U_(0x1) << USB_DEVICE_EPINTENCLR_TRFAIL1_Pos)
#define USB_DEVICE_EPINTENCLR_RXSTP_Msk (_U_(0x1) << USB_DEVICE_EPINTENCLR_RXSTP_Pos)
#define USB_DEVICE_EPINTENCLR_STALL0_Msk (_U_(0x1) << USB_DEVICE_EPINTENCLR_STALL0_Pos)
#define USB_DEVICE_EPINTENCLR_STALL1_Msk (_U_(0x1) << USB_DEVICE_EPINTENCLR_STALL1_Pos)
#define USB_HOST_PINTENCLR_TRCPT0_Msk (_U_(0x1) << USB_HOST_PINTENCLR_TRCPT0_Pos)
#define USB_HOST_PINTENCLR_TRCPT1_Msk (_U_(0x1) << USB_HOST_PINTENCLR_TRCPT1_Pos)
#define USB_HOST_PINTENCLR_TRFAIL_Msk (_U_(0x1) << USB_HOST_PINTENCLR_TRFAIL_Pos)
#define USB_HOST_PINTENCLR_PERR_Msk (_U_(0x1) << USB_HOST_PINTENCLR_PERR_Pos)
#define USB_HOST_PINTENCLR_TXSTP_Msk (_U_(0x1) << USB_HOST_PINTENCLR_TXSTP_Pos)
#define USB_HOST_PINTENCLR_STALL_Msk (_U_(0x1) << USB_HOST_PINTENCLR_STALL_Pos)
#define USB_DEVICE_EPINTENSET_TRCPT0_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_TRCPT0_Pos)
#define USB_DEVICE_EPINTENSET_TRCPT1_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_TRCPT1_Pos)
#define USB_DEVICE_EPINTENSET_TRFAIL0_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_TRFAIL0_Pos)
#define USB_DEVICE_EPINTENSET_TRFAIL1_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_TRFAIL1_Pos)
#define USB_DEVICE_EPINTENSET_RXSTP_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_RXSTP_Pos)
#define USB_DEVICE_EPINTENSET_STALL0_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_STALL0_Pos)
#define USB_DEVICE_EPINTENSET_STALL1_Msk (_U_(0x1) << USB_DEVICE_EPINTENSET_STALL1_Pos)
